package com.sky.framework.common;

import java.util.HashMap;
import java.util.Map;

/**
 * 汉字转拼音转换器
 * 支持Unicode编码范围为19968至40869的所有汉字
 *
 * @author
 */
public final class ChineseSpellConverter {
    public static final int UP_STYLE = 0;
    public static final int LOWER_STYLE = 1;
    public static final int RESERVE_STYLE = 2;
    public static final int CHINESE_CEILING = 40869;
    public static final int CHINESE_FLOOR = 19968;

    /**
     * 汉字拼音列表
     */
    private static String[] strChineseSpellList = {"A", "Ai", "An", "Ang",
            "Ao", "Ba", "Bai", "Ban", "Bang", "Bao", "Bei", "Ben", "Beng",
            "Bi", "Bian", "Biao", "Bie", "Bin", "Bing", "Bo", "Bu", "Ca",
            "Cai", "Can", "Cang", "Cao", "Ce", "Cen", "Ceng", "Cha", "Chai",
            "Chan", "Chang", "Chao", "Che", "Chen", "Cheng", "Chi", "Chong",
            "Chou", "Chu", "Chua", "Chuai", "Chuan", "Chuang", "Chui", "Chun",
            "Chuo", "Ci", "Cong", "Cou", "Cu", "Cuan", "Cui", "Cun", "Cuo",
            "Da", "Dai", "Dan", "Dang", "Dao", "De", "Dei", "Den", "Deng",
            "Di", "Dia", "Dian", "Diao", "Die", "Ding", "Diu", "Dong", "Dou",
            "Du", "Duan", "Dui", "Dun", "Duo", "E", "Ei", "En", "Eng", "Er",
            "Fa", "Fan", "Fang", "Fei", "Fen", "Feng", "Fiao", "Fo", "Fou",
            "Fu", "Ga", "Gai", "Gan", "Gang", "Gao", "Ge", "Gei", "Gen",
            "Geng", "Gong", "Gou", "Gu", "Gua", "Guai", "Guan", "Guang", "Gui",
            "Gun", "Guo", "Ha", "Hai", "Han", "Hang", "Hao", "He", "Hei",
            "Hen", "Heng", "Ho", "Hong", "Hou", "Hu", "Hua", "Huai", "Huan",
            "Huang", "Hui", "Hun", "Huo", "Ji", "Ji", "Jia", "Jian", "Jiang",
            "Jiao", "Jie", "Jin", "Jing", "Jiong", "Jiu", "Ju", "Juan", "Jue",
            "Jun", "Ka", "Kai", "Kan", "Kang", "Kao", "Ke", "Ken", "Keng",
            "Kong", "Kou", "Ku", "Kua", "Kuai", "Kuan", "Kuang", "Kui", "Kun",
            "Kuo", "La", "Lai", "Lan", "Lang", "Lao", "Le", "Lei", "Leng",
            "Li", "Lia", "Lian", "Liang", "Liao", "Lie", "Lin", "Ling", "Liu",
            "Lo", "Long", "Lou", "Lu", "Luan", "Lue", "Lun", "Luo", "Ma",
            "Mai", "Man", "Mang", "Mao", "Me", "Mei", "Men", "Meng", "Mi",
            "Mian", "Miao", "Mie", "Min", "Ming", "Miu", "Mo", "Mou", "Mu",
            "Na", "Nai", "Nan", "Nang", "Nao", "Ne", "Nei", "Nen", "Neng",
            "Ni", "Nian", "Niang", "Niao", "Nie", "Nin", "Ning", "Niu", "Nong",
            "Nou", "Nu", "Nuan", "Nue", "Nun", "Nuo", "O", "Ou", "Pa", "Pai",
            "Pan", "Pang", "Pao", "Pei", "Pen", "Peng", "Pi", "Pian", "Piao",
            "Pie", "Pin", "Ping", "Po", "Pou", "Pu", "Qi", "Qi", "Qia", "Qian",
            "Qiang", "Qiao", "Qie", "Qin", "Qing", "Qiong", "Qiu", "Qu",
            "Quan", "Que", "Qun", "Ra", "Ran", "Rang", "Rao", "Re", "Ren",
            "Reng", "Ri", "Rong", "Rou", "Ru", "Ruan", "Rui", "Run", "Ruo",
            "Sa", "Sai", "San", "Sang", "Sao", "Se", "Sen", "Seng", "Sha",
            "Shai", "Shan", "Shang", "Shao", "She", "Shei", "Shen", "Sheng",
            "Shi", "Shou", "Shu", "Shua", "Shuai", "Shuan", "Shuang", "Shui",
            "Shun", "Shuo", "Si", "Song", "Sou", "Su", "Suan", "Sui", "Sun",
            "Suo", "Ta", "Tai", "Tan", "Tang", "Tao", "Te", "Teng", "Ti",
            "Tian", "Tiao", "Tie", "Ting", "Tong", "Tou", "Tu", "Tuan", "Tui",
            "Tun", "Tuo", "U", "Wa", "Wai", "Wan", "Wang", "Wei", "Wen",
            "Weng", "Wo", "Wu", "Xi", "Xi", "Xia", "Xian", "Xiang", "Xiao",
            "Xie", "Xin", "Xing", "Xiong", "Xiu", "Xu", "Xuan", "Xue", "Xun",
            "Ya", "Yan", "Yan", "Yang", "Yao", "Ye", "Yi", "Yi", "Yin", "Ying",
            "Yo", "Yong", "You", "Yu", "Yuan", "Yue", "Yun", "Za", "Zai",
            "Zan", "Zang", "Zao", "Ze", "Zei", "Zen", "Zeng", "Zha", "Zhai",
            "Zhan", "Zhang", "Zhao", "Zhe", "Zhen", "Zheng", "Zhi", "Zhong",
            "Zhou", "Zhu", "Zhua", "Zhuai", "Zhuan", "Zhuang", "Zhui", "Zhun",
            "Zhuo", "Zi", "Zong", "Zou", "Zu", "Zuan", "Zui", "Zun", "Zuo"};

    /**
     * 汉字拼音首字母列表,本列表包含了20901个汉字,用于配合GetChineseSpell函数使用,本表收录的字符的Unicode编码范围为19968至40869.
     */
    private static String[] strChineseCharList = {
            "A錒阿啊锕嗄厑",
            "Ai堨叆賹礙譺靉諰娭欸焥硙磑騃隑懝欬濭嵦餲絠娾哎哀唉埃挨溾锿鎄啀捱皑凒溰嘊敳皚癌毐昹嗳矮蔼躷噯藹譪霭靄艾伌爱砹硋隘嗌塧嫒愛碍暧瑷僾壒嬡懓薆曖璦鴱皧瞹馤鑀鱫敱",
            "An裺偣腌屵菴媕葊痷闇鵪鶕晻洝諳咹屽厈广玵安侒峖桉氨庵谙萻腤鹌蓭誝鞌鞍盦馣鮟盫韽啽雸垵俺唵埯铵隌揞罯銨犴岸按荌案胺豻堓婩暗貋儑錌黯厂",
            "Ang仰卬骯肮岇昂昻枊盎醠",
            "Ao奥奧隩梎泑眑鴁媼澚墺驁郩媪墽摮磝抝拗鏕熝凹坳垇柪軪爊敖厫隞嗷嗸嶅廒滶獒獓遨熬璈蔜翱聱螯翶謷翺鳌鏖鰲鷔鼇芺袄媪镺襖岙扷岰傲奡嫯慠骜奥奧嶴澳懊擙謸鏊",
            "Ba覇哱罢扒耙皅钯鈀跁罷伯峇丷柭颰鼥鮊鲌伯八仈巴叭扒朳玐吧夿岜芭疤哵捌笆粑羓蚆釟豝鲃魞叐犮抜妭拔茇炦癹胈菝詙跋軷魃把靶坝弝爸垻罢鲅鮁覇矲霸壩灞欛扷",
            "Bai庍犤伯韛伯白百佰柏栢捭竡粨摆擺襬呗拝败拜唄敗稗粺薭贁兡瓸挀掰擘",
            "Ban般坢拌柈跘搫螌褩闆湴鳻朌頒扳攽班般颁斑搬斒瘢螁癍辬阪坂岅昄板版瓪钣粄舨鈑蝂魬办半伴扮姅怑拌绊秚絆鉡靽辦瓣",
            "Bang搒彭挷膀磅髈旁鎊牓棓蛖蚄邦垹帮捠梆浜邫幇幚縍幫鞤绑綁榜膀玤蚌傍棒谤塝稖蒡蜯磅镑艕謗",
            "Bao犳襃宲瀑堡暴曝嚗蚫刨炮剝襃铇袌鉋枹報堡瀑犦勹包佨孢苞胞笣煲龅蕔褒闁齙窇雹宝怉饱保鸨珤堡堢媬葆寚飹飽褓駂鳵緥鴇賲藵寳寶靌勽报抱豹趵菢鲍骲暴髱虣儤曓爆忁鑤嚗剥薄",
            "Bei郥鞞諀椑陂被柸琲棓棑箄杮勃孛庳鞁陂卑杯盃桮悲揹碑鹎藣鵯北鉳贝狈貝邶备昁牬苝背钡俻倍悖狽被偝偹梖珼鄁備僃惫焙軰辈愂碚禙蓓蛽犕褙誖骳輩鋇憊糒鞴鐾呗唄臂",
            "Ben夲漰翉喯衯坋蟦賁夯栟奔泍贲倴渀逩犇锛錛本苯奙畚楍坌捹桳笨撪",
            "Beng跰堋逬絣痭琣嗙奟甮祊埄崩绷閍嵭嘣綳繃甭埲菶琫鞛泵迸塴甏镚蹦鏰跰蚌揼",
            "Bi迊啚鉍娝髲纰怶紕旇翍芘毞肶笓崥睤睥螕鎞粃痺辟稫鞞朇榌禆吡濞祕秘泌苾皀闬閈鶝拂畐胇偪賁佛紴贲屄毴逼豍鲾鵖鰏柲荸鼻匕比夶朼佊吡咇妣沘疕彼柀秕俾笔粊舭筆鄙聛貏币必毕闭佖坒庇诐邲妼怭畀畁哔毖珌疪荜陛毙狴畢袐铋婢敝梐萆萞閇閉堛弻弼愊愎湢皕禆筚詖貱赑嗶彃楅滗滭煏痹腷蓖蓽蜌裨跸閟飶幣弊熚獙碧箅綼蔽鄪馝幤潷獘罼駜髲壁嬖廦篦篳縪薜觱避鮅斃濞臂蹕髀奰璧鄨饆繴襞襣鏎鞸韠躃躄魓贔鐴驆鷝鷩鼊",
            "Bian鞕鶣諚猵萹徧緶辯籓臱玣牑覵閞辺疺貶边砭笾编煸甂箯編蝙獱邉鍽鳊邊鞭鯾鯿籩炞贬扁窆匾惼碥稨褊糄鴘藊卞弁忭抃汳汴苄釆峅便变変昪覍揙缏遍辡艑辧辨辩辫辮變籓",
            "Biao杓灬骠磦篻僄骉蔈謤驃摽颮麃藨穮膔淲鋲彪标飑髟猋脿墂幖滮骠標熛膘瘭镖飙飚儦颷瀌爂臕贆鏢镳飆飇飈飊鑣表婊裱諘褾錶檦俵鳔驫嫑颩",
            "Bie柭柲憋鳖鱉鼈虌龞別别莂蛂徶襒蟞蹩瘪癟彆",
            "Bin频砏汃豩份訜玢檳丙梹邠宾彬傧斌椕滨缤槟瑸賓賔镔儐濒濱濵虨豳瀕霦繽鑌顮摈殡膑髩擯鬂殯臏髌鬓髕鬢",
            "Bing庰屏屛鞞絣稟冫枋昞眪槟鞸仌氷冰兵栟掤梹檳丙邴陃怲抦秉苪昺柄炳饼窉蛃棅禀鈵鞆餅餠并並併幷垪庰倂栤病竝偋傡寎摒誁鮩靐鉼",
            "Bo穛彴殕溊壆哱桲馞謈檘擗蚾蕃嚗剝磻苩瓟伯袹淿皪髉榑噃蕃撥柭襏砵肑癶佛卜簿蔔誖萡趵苩柏瓟碆猼馞嚗髆蚾拨波玻剥盋袯钵饽啵紴缽脖菠鉢僠嶓播餑蹳驋鱍仢伯驳帛泊狛瓝侼勃胉郣亳挬浡秡钹铂舶博渤葧鹁愽搏鈸鉑馎鲌僰煿牔箔膊艊馛駁踣鋍镈薄駮鮊懪礡簙鎛餺鵓欂襮礴鑮跛箥簸孹擘檗糪譒蘗",
            "Bu錻埔鯆柨巭抪堡捗婄箁捬不峬庯逋钸晡鈽誧餔轐醭卜卟补哺捕補鳪鸔不布佈步咘怖歨歩钚勏埗悑部埠瓿廍蔀踄篰餢簿捗鵏吥荹鈈郶堡",
            "Ca攃嚓擦礤礸遪囃拆",
            "Cai啋寀揌偲纔扐猜才材财財戝裁采倸埰婇寀彩採睬跴綵踩菜棌蔡縩乲",
            "Can囋篸参嘇摻喰穇參傪叄叅朁摲孱参飡骖湌嬠餐驂残蚕惭殘慚蝅慙蠶蠺惨慘噆憯黪黲灿粲儏澯薒燦璨爘謲掺",
            "Cang藏臧匨篬瑲玱鸧鶬仓仺伧沧苍倉舱傖凔嵢滄獊蒼濸艙螥藏欌鑶賶",
            "Cao傮慅懆鄵鼜撡操糙曺曹嘈嶆漕蓸槽褿艚螬鏪艹艸草愺騲肏襙屮慒",
            "Ce夨栅拺粣笧筴簎畟册厕恻测荝敇萗惻測策萴筞蓛箣憡冊側侧厠廁",
            "Cen篸喰穇參叄叅埁笒汵嵾岑涔",
            "Ceng竲曽橧噌层層竲驓蹭嶒",
            "Cha揷喳楂扱仛捈梌鎈剎摖詧秅苴詫岾猠乽叉芆杈臿偛嗏插馇銟锸艖疀鍤餷垞查査茬茶嵖搽猹靫槎察碴檫衩镲鑔奼汊岔侘诧姹差紁釵扠挿蹅嚓刹",
            "Chai犲侪柴祡豺喍儕虿袃瘥蠆囆茝钗拆差訍肞芆",
            "Chan僝崭嶃嶄欃颤苂緂繵儃啴嘽裧儃禪蟬繵單摻摌攙顫斺螹覘单譂襜燀澶骣辿觇梴掺搀鋓幨欃婵谗孱棎湹禅馋嬋煘缠獑蝉誗鋋廛潹潺緾磛毚鄽瀍儳劖蟾酁嚵壥巉瀺纏纒躔镵艬讒鑱饞产刬旵丳浐剗谄產産铲阐蒇剷滻幝蕆諂閳簅冁繟醦鏟闡囅灛讇忏硟摲懴颤懺羼韂",
            "Chang兏镸长仧瑒淌倘闛閶仩塲場焻硛硳伥昌娼淐猖菖阊椙琩裮锠錩鲳鯧鼚兏肠苌尝偿常徜瓺萇甞腸嘗嫦瑺膓償嚐蟐鲿鱨厂场昶惝敞僘厰廠氅鋹怅玚畅倡鬯唱悵暢畼誯韔倀长仧",
            "Chao焯窼朝嘲禉槱粆訬仯焣剿摷劋樔抄弨怊欩钞焯超鈔牊晁巢巣朝鄛漅嘲潮窲罺轈吵炒眧煼麨巐仦耖觘鼌謿绰綽",
            "Che焎烲呫揊摰伡俥奲车車砗唓莗硨蛼扯偖撦屮彻坼迠烢聅掣硩頙徹撤澈勶瞮爡尺",
            "Chen陳栕桭趂鍖謓敶愖捵瞋沈綝軙儭櫬跈莀瘨穪偁醦梣傖伧迧陳抻郴棽琛嗔諃賝尘臣忱沉辰陈茞宸烥莐敐晨訦谌煁蔯塵樄瘎霃螴諶薼麎曟鷐趻硶碜墋夦磣踸贂衬疢称龀趁榇稱齓齔嚫谶襯讖迧陳鈂",
            "Cheng埩氶撜朾鐣橖僜鐺珵侱乘椉晟盛乗娍抢搶鎗矃净凈淨称称揨晿罉阷泟柽爯棦浾偁蛏铛牚琤赪憆摚靗撐撑緽橕浧瞠赬頳檉竀穪蟶鏿饓憕徎丞成呈承枨诚郕城宬峸洆荿埕挰珹掁窚脭铖堘惩棖乘椉程筬絾裎塍塖溗碀誠畻酲鋮澂澄橙檙鯎瀓懲騬悜逞骋庱睈騁秤",
            "Chi胵歭遟瘈奓伬眙眵佁狋沶扡拸耛徲鶗鶙菭箈漦鍉匙飭噭袳迡柅袲邌樆勑粚喫噄捇箎俿跢殦坻蚳赿跮吃妛杘侙哧彨蚩鸱瓻眵笞訵嗤媸摛痴瞝螭鴟鵄癡魑齝攡麶彲黐絺遲弛池驰迟茌持竾荎筂貾遅馳墀踟篪謘尺叺呎肔侈卶齿垑胣恥耻蚇豉欼歯裭鉹褫齒彳叱斥灻赤饬抶勅恜炽翄翅敕烾啻湁傺痸腟鉓雴憏翤遫慗瘛翨熾懘趩鶒鷘慸",
            "Chong漴徸緟蝩重涌痋爞埫寵揰充冲忡沖茺浺珫翀舂嘃摏憃憧衝罿艟蹖虫崇崈隀宠铳銃徸褈緟蟲",
            "Chou搊掫薵盩嚋婤诪牰怞臰梼檮綢籌跾醻醔偢杻雦鮘裯儔幬抽瘳篘犨犫仇俦帱栦惆绸菗畴絒愁皗稠筹酧酬踌雔嬦懤燽雠疇躊讎讐丑丒吜杽瞅醜矁魗臭遚殠紬椆詶偢椆",
            "Chu媰菆炪泏助藸慉欪滀嘼俶埱敊耝櫖鋤雛處諔摢出岀畜初摴樗貙齣刍除厨滁蒢豠锄榋耡蒭蜍趎雏犓廚篨橱幮櫉蟵躇櫥蹰鶵躕杵础椘储楮禇楚褚濋儲檚璴礎齭齼芻鉏亍処处竌怵绌豖竐珿絀傗鄐搐触閦儊憷橻斶歜臅黜觸矗",
            "Chua撮欻歘",
            "Chuai搋膗揣啜踹欼膪",
            "Chuan膞喠鶨猭舩篅巛川氚穿剶瑏传舡船圌遄椽歂暷輲舛荈喘僢汌串玔钏釧賗傳堾踳椯",
            "Chuang幢橦朣創闯刅疮窓窗牎摐牕瘡窻床牀噇傸磢闖创怆刱剏剙愴",
            "Chui硾椎腄搥吹炊龡垂桘陲捶菙棰槌锤錘顀倕埀箠鎚圌惙",
            "Chun淳肫膞芚蓴鶉輴朐錞旾杶春萅媋暙椿槆瑃箺蝽橁櫄鰆鶞纯陙唇浱莼淳脣犉滣蒓鹑漘醇醕鯙偆萶惷睶賰蠢純湻",
            "Chuo鏃鋜餟孎箹哾吷拺婼婥淖娕啜踀趠繛踔戳辵娖惙涰绰逴辍酫綽輟龊擉磭歠嚽齪鑡",
            "Ci呰啙薋兹骴伺縒鮆蠀粢齹髊差呲玼疵趀偨词珁垐柌祠茨瓷詞辝慈甆辞磁雌鹚糍辤飺餈嬨濨鴜礠辭鶿鷀此佌皉朿次佽刺刾庛茦栨莿絘蛓赐螆賜泚跐",
            "Cong熜愡鏓碂錝潀徔棇楤漎憁从匆囪囱苁忩枞茐怱悤焧葱漗聡蔥骢暰樬瑽璁聦聪瞛篵聰蟌繱鏦騘驄丛従婃孮徖悰淙琮慒誴賨賩樷藂叢灇欉爜謥從蓯樅緫潨",
            "Cou傶楱凑湊楱腠辏輳",
            "Cu踿卒怚麆皻噈趋趨趣怚踧橻粗觕麁麄麤徂殂促猝媨瘄蔟誎趗憱醋瘯簇縬蹙鼀蹴蹵顣酢",
            "Cuan攒攢濽灒穳窽窾鋑汆撺镩蹿攛躥鑹櫕巑窜熶篡殩簒竄爨欑",
            "Cui濢崒伜倅顇隹趡粋脺熣衰琗缞縗啐崔催凗墔慛摧榱磪鏙乼漼璀皠忰疩翆脃脆啛悴淬萃毳焠瘁粹翠膵膬竁襊臎槯紣綷",
            "Cun拵侟吋膥邨村皴澊竴存刌忖寸籿拵",
            "Cuo撮諎錯縒鎈庴搓瑳遳磋撮蹉醝虘嵯嵳痤矬蒫鹾鹺脞剉剒厝夎挫莝莡措逪锉蓌错銼曾睉瘥蔖",
            "Da迚剳呾笚撘迏迖沓荅逹溚達鎉韃嗒鎝畐咑哒耷畣搭嗒褡噠墶达妲怛垯炟羍荙匒笪答詚跶瘩靼薘鞑燵繨蟽躂鐽龖龘打大亣眔橽惮憚",
            "Dai诒廗棣貣駘骀呔蚮軚貸隸隶箉歺大呆獃懛歹傣代轪侢垈岱帒甙绐迨带待怠柋殆玳贷帯軑埭帶紿袋逮軩瑇叇曃緿鴏戴艜黛簤瀻霴襶靆蹛黱釱棣毒蝳跢",
            "Dan黮黵皽唌呾訑撢愖蓞嘾彈繵澹弹惔弾醈賧癉撣嘾彈餤繵石抌膻単單擔伔僤赕燀丹妉单担眈砃耼耽郸聃躭媅殚瘅匰箪褝鄲頕儋勯殫襌簞聸刐狚玬瓭胆衴疸紞掸酖亶馾澸黕膽旦但帎沊泹诞柦疍啖啗弹惮淡萏蛋啿氮腅蜑觛窞誕噉髧憚憺澹禫駳鴠甔癚嚪贉霮饏",
            "Dang崵婸潒偒嵣愓黨攩欓逿蕩簜蘯闣铛当珰裆筜當儅噹澢璫襠簹艡蟷挡党谠擋譡灙讜氹凼圵宕砀垱荡档菪瓽雼碭瞊趤壋檔璗盪礑",
            "Dao箌螩絩梼檮朷焘燾嘄辺裯幬刂刀叨忉氘舠釖鱽魛捯导岛帱陦倒島捣祷禂搗隝嶋嶌槝導隯壔嶹擣蹈禱到悼盗菿椡盜道稲噵稻衜檤衟翿軇瓙纛翢",
            "De棏脦蚮恴得淂悳惪锝嘚徳德鍀的底地旳",
            "Dei得嘚哋",
            "Den扥扽",
            "Deng僜澄懲憕灯登豋噔嬁燈璒竳簦艠覴蹬等戥邓凳鄧隥墱嶝瞪磴镫櫈鐙",
            "Di秪蹢墆疐樀翟浟扚奃苐媂棣弟珶提渧碮蝭揥楴蓧奃髢詆苐媂諦諟遞遰哋坔覿枑埅的坘岻篴拞牴觝啇摕蝃踶仾低彽袛啲埞羝隄堤趆嘀滴镝磾鞮鏑廸狄肑籴苖迪唙敌涤荻梑笛觌靮滌嫡蔋蔐頔敵嚁藡豴糴鸐氐厎诋邸阺呧坻底弤抵柢砥掋菧軧聜骶鯳地弟旳杕玓怟枤俤帝埊娣递逓偙梊焍眱祶第菂谛釱棣睇缔蒂僀禘腣鉪馰墑墬碲蔕慸甋締嶳螮嵽",
            "Dia嗲",
            "Dian槇佔橝跕窴痶顚顛鈿甸痁敁掂傎厧嵮滇槙瘨颠蹎巅癫巓巔攧癲齻典奌点婰敟椣碘蒧蕇踮电佃阽坫店垫扂玷甸钿婝惦淀奠琔殿蜔電墊壂橂澱靛磹癜簟驔點",
            "Diao盄鳭銚扚铫誂絩錭蓧鳥鸟铫魡藋刁叼汈刟虭调凋奝弴彫蛁琱貂碉瞗雕鮉鲷簓鼦鯛鵰屌弔伄吊钓窎訋掉釣铞鈟竨銱雿瘹窵鋽鑃鳭調椆",
            "Die螲柣喋軼泆佚楪昳鞢槢諜怢鴩鐡惵趃啑崼挕哋爹跌褺苵迭垤峌恎绖胅瓞眣耊戜谍堞幉揲畳絰耋詄叠殜牃牒镻嵽碟蜨褋艓蝶疂蹀鲽曡疉疊氎嚸喋臷鰈眰咥",
            "Ding掟艼鋌濎奵忊釘町铤虰丁仃叮帄玎甼疔盯钉耵酊靪顶頂鼎嵿薡鐤订饤矴定訂飣啶萣椗腚碇锭碠聢錠磸顁鼑",
            "Diu丟丢铥颩銩",
            "Dong侗垌峒狪烔絧勭燑湩墥揰东冬咚岽東苳昸氡倲鸫埬娻崬涷笗菄氭蝀鮗鼕鯟鶇鶫董嬞懂箽蕫諌动冻侗垌姛峒恫挏栋洞胨迵凍戙胴動崠硐棟腖働駧霘",
            "Dou唞钭鋀侸吺毭狵瞗吋剅唗都兜兠蔸橷篼艔斗乧阧抖陡蚪鈄豆郖浢荳逗饾鬥梪脰酘痘閗窦鬦餖斣闘竇鬪鬬鬭枓读渎瀆",
            "Du竺斁暏阇闍啓姤顿都剢嘟督醏毒涜读渎椟牍犊裻読獨錖凟匵嬻瀆櫝殰牘犢瓄皾騳黩讀豄贕韣髑鑟韇韥黷讟厾独笃堵琽赌睹覩賭篤芏妒杜肚妬度荰秺渡靯镀螙殬鍍蠧蠹",
            "Duan剬褍偳媏端鍴短段断塅缎葮椴煅瑖腶碫锻緞毈簖鍛斷躖籪叾耑",
            "Dui轛追瀢濻啍憞杸兊兌垖堆塠嵟痽頧鴭鐜队对兑対祋怼陮碓綐對憝濧薱懟瀩譈镦譵磓隊敦敓敚",
            "Dun憞坉忳蜳橔囤庉憞燉吨惇敦墩墪壿撴獤噸撉犜礅蹲蹾驐盹趸躉伅沌炖盾砘逇钝顿遁鈍頓碷遯潡踲墫镦鐓",
            "Duo硾喥杝柂柮仛沲沰驮柁馱駄媠仛軃隋陏敠袳隳隓墮度杕枤奲多咄哆剟夛喥崜毲裰嚉夺铎剫掇敓敚敪痥鈬奪凙踱鐸朵朶哚垛挅挆埵缍椯趓躱躲綞亸鬌嚲刴剁沲陊饳垜尮桗堕舵惰跢跥跺飿憜墯鵽",
            "E堨堊搤姶閼痷洝僫惡噁鋨礘哦鈪咹搕痾岋齃吪魤頋鰪娾妸妿娿屙讹囮迗俄娥峨峩涐莪珴訛皒睋鈋锇鹅蛾磀誐頟额額鵝鵞譌枙砈婀騀鵈厄戹阨呃扼苊阸呝砐轭咢垩峉匎恶砨蚅饿偔卾悪硆谔軛鄂阏堮崿愕湂萼豟軶遌遏廅搹琧腭僫蝁锷鹗蕚遻頞颚餓噩擜覨諤餩鍔鳄歞顎櫮鰐鶚讍鑩齶鱷",
            "Ei誒诶欸",
            "En煾唔奀恩蒽峎摁嗯",
            "Eng鞥",
            "Er唲髶杒梕児兒耏聏尒尓爾鉺仒乻旕儿而侕陑峏洏荋栭胹袻鸸粫輀鲕隭髵鮞鴯轜尔耳迩洱饵栮毦珥铒餌駬薾邇趰二弍弐佴刵咡贰貮衈貳誀樲",
            "Fa酦笩峜冹蕟墢发沷発發彂髪橃醗乏伐姂垡疺罚阀栰傠筏瞂罰閥罸藅佱法砝鍅灋珐琺髮茷坺",
            "Fan拚蕃籓畨犿婏輽桳帆忛番勫膰噃墦嬏幡憣旙旛翻藩轓颿飜鱕凡凢凣匥杋柉矾籵钒舤烦舧笲釩棥煩緐樊蕃橎燔璠薠繁襎繙羳蹯瀿礬蘩鐇蠜鷭反仮払返氾犯奿汎泛饭范贩畈訉軓梵盕笵販軬飯飰滼嬎範瀪籓",
            "Fang匚彷汸眪祊方邡坊芳枋牥钫淓蚄堏鈁錺鴋防妨房肪埅鲂魴仿访纺昉昘瓬眆倣旊紡舫訪髣鶭放趽",
            "Fei胏柹陫犻朏胐笰砩芾橨橃胇贲犻飞妃非飛啡婓婔渄绯菲扉猆靟裶緋蜚霏鲱餥馡騑騛鯡飝肥淝暃腓蜰蟦匪诽奜悱斐棐榧翡蕜誹篚吠废杮沸狒肺昲费俷剕厞疿屝萉廃費痱镄廢曊癈鼣濷櫠鐨靅",
            "Fen砏坆獖玢分吩帉纷芬昐氛竕紛翂棻躮酚鈖雰朆餴饙坟妢岎汾枌炃肦梤羒蚠蚡棼焚蒶馚隫墳幩蕡魵鳻橨燌燓豮鼢羵鼖豶轒鐼馩黂粉瞓黺份坋弅奋忿秎偾愤粪僨憤奮膹糞鲼瀵鱝",
            "Feng蘴漨熢莑摓炐蠭堼浲埄丰风仹凨凬妦沣沨凮枫封疯盽砜風峯峰偑桻烽琒崶渢溄猦葑锋楓犎夆蜂瘋碸僼篈鄷鋒檒豐鎽鏠酆寷灃靊飌麷馮冯捀逢堸綘缝艂縫讽覂唪諷凤奉俸湗焨煈赗鳯鳳鴌賵瓰",
            "Fiao覅",
            "Fo仸仏坲梻佛",
            "Fou殕妚炰紑缶否缹缻雬鴀不",
            "Fu妋蓲頫棴秿鏷襥抙捊箁垺峊俛宓嘸呒撫璷鄜膚鬴鳺嬔払柭袚颰佛夫伕邞呋姇枎玞肤怤柎砆荂衭娐荴旉紨趺酜麸稃跗鈇筟綒孵敷麩糐麬麱懯尃豧巿襆脯蜅秿胕乀弗伏凫甶刜孚扶芙芣芾咈岪帗彿怫服泭绂绋苻茀俘垘枹柫氟洑炥玸畉拂畐祓罘茯郛韨鳬哹栿浮畗蚨匐桴涪莩烰琈符笰砩紱"
                    + "紼翇艴菔虙袱幅絥罦葍福粰綍艀蜉辐鉘鉜颫鳧榑稪箙複韍幞澓蝠髴鴔諨踾輻鮄癁鮲黻鵩鶝抚甫府弣拊斧俌郙俯釜釡捬辅椨焤盙腑滏腐輔簠黼父讣付妇负附咐坿竎阜驸复祔訃負赴蚥袝偩冨副婏婦蚹傅媍富復萯蛗覄詂赋椱缚腹鲋禣褔赙緮蕧蝜蝮賦駙縛輹鮒賻鍑鍢鳆覆馥鰒副",
            "Ga轧軋夹夾釓朒咖夹伽旮伽嘠钆尜嘎噶錷尕玍尬魀",
            "Gai摡硙磑隑芥侅郂絯该陔垓姟峐荄晐赅畡祴該豥賅賌忋改絠丐乢匃匄杚钙溉盖葢鈣戤概蓋槩槪漑瓂",
            "Gan鳱咁乾姏篢榦忓攼仠桿汵玵干甘芉迀杆玕肝坩泔苷柑竿疳酐粓凲尲尴筸漧尶尷魐皯秆衦赶敢稈感澉趕橄擀簳鳡鱤旰盰矸绀倝凎淦紺詌骭幹檊赣灨贛贑",
            "Gang戇焹矼碙犺扛摃冈冮刚岗纲肛岡牨疘缸钢剛罡堈掆釭棡犅堽綱罁鋼鎠崗港杠焵筻槓戆",
            "Gao羙槀稾藳獋臯鎬皋皐羔高髙槔睾膏槹橰篙糕餻櫜韟鷎鼛鷱夰杲菒稁搞缟槁稿镐縞藁檺吿告勂诰郜峼祮祰锆筶禞誥鋯睪",
            "Ge仡鎑輵猲吤鞈扢肐鮥茖蛒鎘鉻嘅裓紇鲄颌合犵挌蛤咯嗰笴盖戈圪纥戓疙哥胳袼鸽割搁彁歌滒戨閤鴚擱謌鴿鎶呄佮匌阁革敋格鬲愅臵葛隔嗝塥滆觡搿槅膈閣镉韐骼諽鮯櫊韚轕鞷騔哿舸个各虼個硌铬箇獦牫",
            "Gei給给",
            "Gen亙根跟哏亘艮茛揯搄",
            "Geng羮颈絙更刯庚畊浭耕菮椩焿絚赓鹒緪縆賡羹鶊郠哽埂峺挭绠耿莄梗綆鲠骾鯁",
            "Gong糿龏廾篢紅澒銾厷愩唝羾侊堩工弓公功攻杛供糼肱宫宮恭躬龚匑塨幊觥躳匔碽髸觵龔巩汞拱拲栱珙輁鞏共贡貢蚣慐熕兝兣",
            "Gou呴蚼鉤啂溝痀句拘傋芶構詬糓勾佝沟钩袧缑鈎緱褠篝簼鞲韝岣狗苟枸玽耇耉笱耈豿坸构诟购垢姤冓够夠訽媾彀搆遘雊煹觏撀覯購",
            "Gu蠱夃嗗皼扢磆櫎贾賈家櫎抇怘淈鈷鹄縎鶻呱苽杚估咕姑孤沽泒柧轱唂唃罛鸪笟菇菰蛄蓇鈲觚軱軲辜酤毂箍箛嫴篐橭鮕鴣轂鹘古汩诂谷股牯骨罟羖逧钴傦啒脵蛊尳愲詁馉榾鼓鼔嘏榖皷穀糓薣濲臌餶瀔盬瞽固故凅顾堌崓崮梏牿棝祻雇痼稒锢僱錮鲴鯝顧",
            "Gua铦銛咼踻桰栝括絓颳諣趏呙袿瓜刮胍鸹歄煱颪劀緺銽鴰騧冎叧呱剐剮啩寡卦坬诖挂掛罣罫褂詿",
            "Guai夬叏摑掴罫乖拐枴柺箉怪恠",
            "Guan斡関闗關貫矝琯矔鸛綸纶卝丱鰥莞矜雚淉璭閞关观官冠覌倌棺蒄窤瘝癏観鳏觀鱞馆痯筦管輨舘錧館躀鳤毌贯泴悺惯掼涫悹祼慣摜遦樌盥罆鏆灌爟瓘礶鹳罐鑵鱹",
            "Guang挄硄廣獷臩臦潢洸光灮炗炚炛咣垙姯茪桄烡珖胱僙輄銧黆欟广広犷俇逛撗",
            "Gui溎巂規嶲鮭巂鬹廆硊癐姽恑瞶窐騩眭朹龜氿鐀鑎樻匱匮傀蘬胿歸嶡趹簂槣昋鱖檜螝櫰襘鞼桧鳺猤軓归圭妫龟规邽皈茥闺嫢帰珪亀硅袿媯椝瑰郌摫閨鲑嬀槻槼璝瞡鬶瓌櫷宄轨庋佹匦诡陒垝癸軌鬼庪祪匭晷湀蛫觤詭厬簋蟡刽刿攰柜炅攱贵桂椢筀貴蓕跪瞆劊劌撌槶禬簂櫃鳜鱥",
            "Gun硍裷緷丨睔緄衮惃绲袞辊滚蓘滾蔉磙輥鲧鮌鯀棍謴",
            "Guo喐蟈涡渦囗咼堝濄腂懖矌楇櫎腘膕粿輠過簂呙埚郭啯崞聒鈛锅墎瘑嘓彉蝈鍋彍囯囶囻国圀國帼幗慖漍聝蔮虢馘果惈淉猓菓馃椁褁槨綶蜾裹餜鐹过",
            "Ha虾奤鉿蛤潅铪哈紦",
            "Hai拸猲還咍咳妎还郂絯嗨孩骸海胲烸塰酼醢亥骇害氦嗐餀駭駴嚡饚乤",
            "Han輚鳱闞譀漢熯肣馯嫨歛阚笒忓攼仠汵旰兯厂佄顸哻蚶酣頇谽憨馠魽鼾邗含邯函凾虷唅圅娢浛崡晗梒涵焓寒嵅韩甝筨爳蜬澏鋡韓厈罕浫喊蔊豃汉屽扞汗旱垾悍捍晘涆猂莟焊琀菡釬闬閈皔睅傼蛿颔撖蜭暵銲鋎憾撼翰螒頷顄駻雗瀚鶾",
            "Hang裄巷迒吭邟妔行桁魧苀斻杭垳绗笐航蚢颃貥筕絎頏沆夯",
            "Hao乚藃呺諕滈茠鄗貉秏薧悎鎬暠滜獔镐侴蒿嚆薅竓蚝毫椃嗥獆噑豪嘷獋儫曍嚎壕濠籇蠔譹好郝号昊昦哠恏浩耗晧淏傐皓聕號暤暭澔皜皞皡薃皥颢灏顥鰝灝兞",
            "He噈喛猲謞嚇吓螛欱郃螛嗃熇燺咼鞨朅抲頜礉隺狢貈貉苛袔毼鹖餄饸紇鶮呙閤纥盖葢釛诃呵喝訶嗬蠚禾合何劾咊和姀河峆曷柇盇籺阂哬敆核盉盍荷啝涸渮盒菏萂龁惒粭訸颌楁詥鉌阖鲄熆閡鹖麧澕篕翮魺闔齕覈鶡皬鑉龢佫垎贺寉焃賀煂碋褐赫鹤翯壑癋爀鶴靍靎鸖靏",
            "Hei嗨黒黑嘿潶",
            "Hen噷哏拫痕鞎佷很狠詪恨",
            "Heng撗亨哼悙涥脝姮恆恒桁烆珩胻鸻横橫衡鴴鵆蘅鑅啈",
            "Ho乊乥",
            "Hong呍瓨揈闀閧闂鬨渹沗吽屸谾紅厷愩唝羾浲慐溄叿灴轰哄訇烘軣焢硡薨輷嚝鍧轟仜弘妅红吰宏汯玒纮闳宖泓玜苰垬娂洪竑荭虹浤紘翃耾硔紭谹鸿渱竤粠葒葓鈜閎綋翝谼潂鉷鞃魟篊鋐彋蕻霐黉霟鴻黌晎嗊讧訌撔澒銾",
            "Hou呴銗翵吽齁茩侯矦喉帿猴葔瘊睺篌糇翭骺鍭餱鯸吼犼后郈厚垕後洉逅候鄇堠豞鲎鲘鮜鱟",
            "Hu瓡嚛觷许唬芐戱戲戏謼滸芐嗃幠膴礐隺姱楛搰恗嗀濩芔和鵠怘鹄縎鶻豰俿淲鹘乎匢虍呼垀忽昒曶泘苸烀轷匫唿惚淴虖軤雽嘑寣滹雐歑囫抇弧狐瓳胡壶壷斛焀喖壺媩湖猢絗葫楜煳瑚嘝蔛鹕槲箶糊蝴衚魱縠螜醐頶觳鍸餬瀫鬍鰗鶘鶦鶮乕汻虎浒唬萀琥虝錿互弖戶户戸冱帍护沍沪岵怙戽昈枑祜笏粐婟扈瓠綔鄠嫭嫮摢滬蔰槴熩鳸簄鍙鹱護鳠頀鱯鸌",
            "Hua枠釪搳譮觟釫呚譁鋘舙磆華蕐砉夻豁吪花芲埖婲椛硴糀誮錵蘤华哗姡骅铧滑猾嘩撶螖鏵驊鷨化划杹画话崋桦婳畫嬅畵話劃摦槬樺嫿澅諙諣黊繣",
            "Huai瀤咶佪怀徊淮槐褢踝懐褱懷櫰耲蘹坏壊壞蘾",
            "Huan獂蒝垸喛瓛嬛懁郇狟澴還镮鐶綄孉瞏酄櫎鵍圜雚犿欢歓鴅嚾懽獾歡貛讙驩还环峘洹荁桓萈萑堚寏絙雈羦貆锾阛寰缳環豲鍰鹮糫繯轘闤鬟睆缓緩攌幻奂肒奐宦唤换浣涣烉患梙焕逭喚嵈愌換渙痪煥瑍豢漶瘓槵鲩擐澣藧鯇鯶鰀",
            "Huang揘韹熀朚爌汻巟肓荒衁塃慌皇偟凰隍黃黄喤堭媓崲徨惶湟葟遑楻煌瑝墴潢獚锽熿璜篁艎蝗癀磺穔諻簧蟥鍠餭鳇趪鐄騜鰉鱑鷬怳恍炾宺晃晄奛谎幌愰詤縨謊櫎皩兤滉榥曂皝鎤",
            "Hui哕袆煇褘蚘噦銊潰孈儶濊椲廆撝鏸颒湏瘣殨溃會澮璯蘳嬒墮桧堕屶灰灳诙咴恢拻挥洃虺晖烣珲豗婎媈揮翚辉隓暉楎琿禈詼幑睳噅噕翬輝麾徽隳瀈鰴囘回囬佪廻廽恛洄茴迴烠逥痐蛔蛕蜖鮰悔螝毇檓燬譭卉屷汇会讳泋哕浍绘芔荟诲恚恵烩贿彗晦秽喙惠絵缋翙阓匯彙彚毀毁滙詯賄僡嘒蔧誨圚寭慧憓暳槥潓蕙徻橞獩璤薈薉諱頮檅檜燴篲藱餯嚖懳瞺穢繢蟪櫘繪翽譓闠鐬靧譿顪",
            "Hun湷眃蔒焄葷轋湣惛殙尡婫餛琿珲棍睴昏昬荤婚涽阍棔睧睯閽忶浑馄渾魂鼲诨俒倱圂掍混焝溷慁觨諢",
            "Huo篧彟彠喐矆窢掝濊蒦嚄擭雘艧閄靃灬煷礊秳漷姡韄秴和趏吙耠锪劐鍃豁攉騞佸活秮火伙邩钬鈥夥沎或货咟俰捇眓获剨祸貨惑旤湱禍奯濩獲霍檴謋穫镬嚯瀖耯藿蠖嚿曤臛癨矐鑊",
            "Ji汥磼乁撽擊蔇繫給嫅濈趞緁魥咭諆櫭皀畟簎諔堲茤丌讥击刉叽饥乩刏圾机玑肌芨矶鸡枅咭迹剞唧姬屐积笄飢基绩喞嵆嵇犄筓赍勣嗘畸跻鳮僟箕銈嘰撃槣樭畿缉稽躸齑墼憿機激璣積錤隮磯簊績羁賷櫅耭雞譏韲鶏譤癪躋鞿鷄齎羇虀鑇覉鑙齏羈鸄覊亼及伋吉岌彶忣汲级即极亟",
            "Ji系亽淁荠摖薺帺鬾綨踑懠魕其奇期鐖饑焏踖躤蟣済濟攲敧稘毄緝觭禨屰苙鷇藉櫭魝尐诘革佶郆卽叝姞急皍笈級揤疾楖嚌璾鯽穧觙偮卙庴脨谻戢棘極殛湒集塉嫉愱楫蒺蝍趌辑槉耤膌銡嶯潗瘠箿蕀蕺鞊鹡橶檝螏輯襋蹐鍓艥籍轚鏶霵鶺鷑雧几己丮妀犱泲虮挤脊掎鱾幾戟嵴麂魢撠擠穖彑旡计记伎纪坖妓忌技芰际剂季哜垍既洎济紀茍計剤紒继觊記偈寂寄徛悸旣梞祭惎臮葪兾痵継蓟裚跡際暨漃漈禝稩穊誋跽霁鲚暩稷諅鲫冀劑曁穄薊襀髻檕繋罽覬鮆" +
                    "檵蹟鵋齌廭懻癠蘎骥鯚瀱繼蘮鱀蘻霽鰶鰿鱭驥",
            "Jia猰拁挾颉挟夏瘕徦夾埉浹傢裌叚徍宊茄袷唊脥價擖挟忦颉拮哿鴐伽加夹抸佳泇迦枷毠浃珈家痂梜笳耞袈猳葭跏犌腵鉫嘉镓糘豭貑鎵麚圿扴岬郏荚郟恝莢戛铗戞蛱颊蛺鋏頬頰鴶鵊甲玾胛斚钾婽斝椵贾賈鉀榎槚瘕檟价驾架假嫁幏榢稼駕嗧",
            "Jian籈橏譛玪豜豣攕稴堿鰔梘筧礆見閒瞯錽鎫僣蔪櫼帴釼釰楗浅傔堑塹雃靬鳒鰜鶼鑯揃漸朁跈聻礷撿諫暕監譼槛檻鵑鋑椾碊鳽餰栫袸濺瀳鏩戋奸尖幵坚歼间冿戔肩艰姦姧兼监堅惤猏笺菅菺湔牋犍缄葌間搛椷煎瑊睷缣蒹箋樫熞緘蕑蕳鲣鹣熸篯縑鋻艱鞬馢麉瀐鞯殱礛覸鵳瀸殲籛韀鰹囏虃韉囝拣枧俭柬茧倹挸捡笕减剪检湕趼揀検減睑硷裥詃锏弿瑐简絸谫彅戩戬碱儉翦檢藆襇襉謇蹇瞼簡繭謭鬋鰎鹸瀽蠒鐗鐧鹻譾襺鹼见件建饯剑洊牮荐贱俴健剣涧" +
                    "		珔舰剱徤渐谏釼寋旔楗毽溅腱臶践賎鉴键僭榗劍劎墹澗箭糋諓賤趝踐踺劒劔橺薦鍵餞瞷磵礀螹鍳擶繝覵艦轞鑑鑒鑬鑳",
            "Jiang將塂強强摪彊勥港江姜将茳浆畕豇葁翞僵漿螀壃缰薑橿殭螿鳉疅礓疆繮韁鱂讲奖桨傋蒋奨奬蔣槳獎耩膙講顜匞匠夅弜降洚绛弶絳畺酱摾滰嵹犟糡醤糨醬櫤謽",
            "Jiao灂徺侥烄僥恔校憢嘐鵁轇驕絞較喬癄釥湫湬蟜譑峤嶠潐噭燋茮澆摎捁撟龣覺嚼覐斍覚觉憿悎樔繳交郊姣娇峧浇茭骄胶椒窌焦蛟跤僬嘄虠鲛嬌嶕嶣憍膠蕉膲礁穚鮫鹪簥蟭鐎鷦鷮櫵臫佼挢狡绞饺晈笅皎矫角脚铰搅筊勦敫煍腳賋暞踋鉸餃儌剿摷劋撹徼敽敿缴曒璬矯纐皦孂攪灚鱎叫呌挍訆珓轿较敎教窖滘嘂嘦斠漖酵噍嬓獥藠趭轎醮譥皭釂",
            "Jie謯搩唶碣嶰瑎絜颉解湝頡觧吤她啑菨嫅卪洯袷椄疌倢偼媫蛣楬鮚袷價扢嵑嶱楷悈镼桔袓杢价跲家偈紒哜趌嚌狤妎裓喼掶鎅卩擳阶疖皆接掲痎秸階喈嗟堦媘揭脻街煯稭鞂蝔擑癤鶛孑节讦刦刧劫岊昅刼劼杰衱尐诘拮洁结迼桀桝莭訐婕崨捷袺傑結颉嵥楶滐睫節蜐詰鉣截榤碣竭蓵鲒潔羯誱踕幯嶻擮礍鍻巀蠞蠘蠽姐毑媎解飷檞丯介岕庎戒芥屆届斺玠界畍疥砎衸诫借蚧徣堺楐琾蛶骱犗誡褯魪藉",
            "Jin臸唫釿嬐伒馸仐歏菳矝婜歏慬埐荕厪墐濅竻榗笒巾今斤钅兓金釒津矜砛衿觔珒紟惍琎堻琻筋璡鹶黅襟仅卺巹紧堇菫僅谨锦嫤廑漌盡緊蓳馑槿瑾錦謹饉尽劤劲勁妗近进侭枃浕荩晉晋浸烬赆祲進煡缙寖搢溍禁靳瑨僸凚殣觐儘噤縉賮嚍壗嬧濜藎燼璶覲贐齽",
            "Jing莖俓鋞坓坙巠殑擏箐涇鶄綡倞靓粇脛踁殌劤劲勁坕葏澋京泾经茎亰秔荆荊婛惊旌旍猄竧経菁晶稉腈睛粳經兢精聙橸鲸鵛鯨鶁麖鼱驚麠井丼阱刭宑汫汬肼剄穽颈景儆幜憬璄憼暻璟璥頸蟼警妌弪径迳浄胫净凈淨弳徑痉竞逕婙婧桱梷竟竫敬痙傹靖境獍誩静頚曔镜靜瀞鏡競竸",
            "Jiong泂銄顈冂扄臩臦炅冋坰扃埛絅駉駫蘏冏囧迥侰炯逈浻烱煚窘颎綗僒煛熲澃燛褧蘔",
            "Jiu稵揂捄氿剹樛摎牞鳩丩勼纠朻究糺鸠糾赳阄萛啾揪揫鬏鬮九久乆乣奺汣杦灸玖舏韭紤酒镹韮匛旧臼咎疚柩柾倃桕厩救就廄匓舅僦廏廐慦殧舊鹫鯦麔匶齨鷲欍",
            "Ju珇蒩怚繘僪貗揟眗鼰鼳螶渠且趄跔鮈跼趜弆瞿鐻窶寠怐桔蓻伡俥柜枸啹车車岨齟怚跙砠凥抅匊居拘泃狙苴驹倶挶疽罝陱娵婅婮崌掬梮涺椐琚腒锔裾雎艍蜛諊踘鋦駒鴡鞠鞫鶋局泦侷狊毩淗焗菊郹椈毱湨犑輂粷躹閰橘檋駶鵙蹫鵴巈蘜鶪驧咀沮举矩莒挙椇筥榉榘蒟龃聥舉踽擧櫸欅襷句巨讵姖岠怇拒洰邭具拠昛歫炬秬钜俱倨剧粔耟蚷袓埧埾惧据詎距焣犋鉅飓虡豦锯愳窭聚駏劇勮屦踞鮔壉懅據澽遽鋸屨颶簴躆醵懼苣",
            "Juan朘縳悁奍焆飬鞙讂梋鋗絹獧闂嶲巂婘惓腃巻椦捲弮姢娟捐涓裐鹃勬鋑镌鎸鐫蠲卷呟帣埍菤锩臇錈奆劵倦勌桊狷绢隽淃瓹眷鄄睊絭罥睠慻蔨餋羂脧雋",
            "Jue叕穱弡繘噊矞鐍妜疦吷決泬噱壆埆詘忂匷璚躩蚗傕焳燋袦觮崫駃櫭角脚髉鳜捔噘撅撧屩屫亅孒孓决刔氒诀抉芵玦玨挗珏砄绝虳觉倔欮崛掘斍桷覐觖訣赽趹厥絕絶覚趉鈌劂瑴谲嶡嶥憰熦爴獗瘚蕝蕨鴂鴃憠橛橜爵臄镢蟨蟩爑譎蹶蹷嚼矍覺鐝灍爝觼彏戄攫玃鷢矡貜钁",
            "Jun頵賐姰濬葰箘麇麏麕焌箘龜攈攟隽雋棞龟军君均汮袀軍钧莙蚐桾皲菌鈞碅筠皸皹覠銁銞鲪麇鍕鮶呁俊郡陖埈峻捃晙浚馂骏珺畯竣箟蜠儁寯懏餕燇駿鵔鵕鵘",
            "Ka咯嬶咔咖喀卡佧垰胩裃鉲",
            "Kai欯忾愾岂愒開濭嵦开奒揩锎鐦凯剀垲恺闿铠凱剴慨蒈塏愷楷輆暟锴鍇鎧闓颽忾炌烗勓嘅鎎乫",
            "Kan扻顑埳闞凵嵌欿歁槛檻鬫刊栞勘龛堪戡龕冚坎侃砍莰偘惂輡竷轗看衎崁墈阚瞰磡矙嵁",
            "Kang忼砊粇康嫝嵻慷漮槺穅糠躿鏮鱇扛亢伉匟邟囥抗犺闶炕钪鈧閌",
            "Kao丂嵪薧尻髛攷考拷洘栲烤铐犒銬鲓靠鮳鯌",
            "Ke艐窼閜硞殼壳揢匼愘殻揢歁砢欬衉悈磆袔蚵濭呵铪牱匼坷苛柯牁珂科轲疴趷钶嵙棵痾萪軻颏搕犐稞窠鈳榼薖颗樖瞌磕蝌頦醘顆髁礚壳咳翗嶱可岢炣渇嵑敤渴克刻剋勀勊客峇恪娔尅课堁氪骒缂嗑愙溘锞碦緙課錁礊騍剋尅",
            "Ken珢龂龈硍貇肎肯肻垦恳啃豤墾錹懇掯裉褃",
            "Keng揁殸坈摼挳硜妔阬劥吭坑硁牼铿硻誙銵鍞鏗巪乬唟厼",
            "Kong羫椌矼涳空倥埪崆悾硿箜躻錓鵼孔恐控鞚廤",
            "Kou眗竘摳佝抠芤眍剾彄瞘口劶叩扣怐敂冦宼寇釦窛筘滱蔲蔻瞉簆鷇",
            "Ku扝硞矻挎捁搰朏胐刳郀枯哭桍堀圐跍窟骷鮬狜苦楛库俈绔庫秙焅袴喾絝裤瘔酷褲嚳",
            "Kua晇趶誇恗楇絓夸姱舿侉咵垮銙挎胯跨骻",
            "Kuai噲墤蕢蒉欳駃會澮璯浍会蒯擓巜凷圦块快侩郐哙狯脍塊筷鲙儈鄶廥獪膾旝糩鱠",
            "Kuan欵歀臗宽寛寬髋鑧髖梡款窽窾",
            "Kuang忹迋抂硄卝丱匡劻诓邼匩哐恇洭筐筺誆軭狂狅诳軖軠誑鵟夼儣懭邝圹纩况旷岲況矿昿贶框眖砿眶絋絖貺軦鉱鋛鄺壙黋懬曠爌矌礦穬纊鑛",
            "Kui潰鮭隗巋磈瞶謉饋犪巙膭胿瞆亏刲岿悝盔窥聧窺虧闚顝奎晆逵鄈馗喹揆葵骙戣暌楏楑魁睽蝰頯櫆藈鍨鍷騤夔蘷虁躨傀煃跬頍蹞尯匮喟媿愦愧溃蒉馈匱嘳嬇憒篑聩聭殨餽簣聵籄",
            "Kun貇坤昆晜堃堒婫崐崑猑菎裈焜琨髠裩锟髡鹍潉蜫褌髨熴瑻醌錕鲲騉鯤鵾鶤悃捆阃壸梱祵硱稇裍壼稛綑閫閸困涃睏",
            "Kuo髺铦銛噋噋擴适秳漷秮銽扩拡括挄筈萿葀蛞阔廓頢濶闊鞟韕霩鞹鬠穒",
            "La蜡腊搚落垃拉柆啦翋菈邋旯砬揦磖喇藞嚹剌溂腊揧楋瘌蜡蝋辢辣蝲臈攋櫴爉臘鬎瓎镴鯻蠟鑞鞡擸",
            "Lai癘疠攋櫴娕誺賫来來俫倈崃徕涞莱郲婡崍庲徠梾淶猍萊逨棶琜筙铼箂錸騋鯠鶆麳唻赉睐睞赖賚濑賴頼顂癞鵣瀨瀬籁藾癩襰籟",
            "Lan懢壏囕厱啉惏顲暕蘫坔燷兰岚拦栏婪嵐葻阑蓝谰澜褴儖斓篮燣藍襕镧闌璼襤譋幱攔瀾灆籃繿蘭斕欄襴囒灡籣欗讕躝襽鑭钄韊览浨揽缆榄漤罱醂壈懒覧擥嬾懶孄覽孏攬欖爦纜烂滥燗嚂濫爁爛爤瓓灠糷",
            "Lang斏崀哴啷勆郎郞欴狼莨嫏廊桹琅蓈榔瑯硠稂锒筤艆蜋郒螂躴鋃鎯駺朗阆朖烺塱蓢樃誏閬朤埌浪蒗",
            "Lao嘮躼耂閖絡络捞粩撈劳労牢狫窂哰唠崂浶勞痨铹僗嶗憥朥癆磱簩蟧醪鐒顟髝老佬咾姥恅荖栳珯硓铑蛯銠潦橑鮱轑涝烙嗠耢酪嫪憦澇橯耮軂",
            "Le楽樂鱳了肋仂阞牞乐叻忇扐氻艻玏泐竻砳勒楽韷簕鳓鰳饹餎",
            "Lei祱勒瘣雷嫘缧蔂樏畾檑縲镭櫑瓃羸礧纍罍蘲鐳轠壨鑘靁虆鱩欙纝鼺厽耒诔垒塁絫傫誄磊蕌磥蕾儡壘癗藟櫐矋礨灅蠝蘽讄儽鑸鸓肋泪洡类涙淚累酹銇頛頪擂錑攂礌颣類纇蘱禷嘞",
            "Leng唥塄棱楞碐稜踜薐冷倰堎愣睖",
            "Li叕迣杝柂纅擽貍櫟躒扚蝷纚釐斄叓麗攦沵犛觻睙峢浰脷扐砬鎘銐悝沴酈唎刕厘剓梨狸离荲莉骊悡梸犁菞喱棃犂鹂剺漓睝筣缡艃蓠蜊嫠孷樆璃盠竰糎蔾褵鋫鲡黎篱縭罹錅蟍謧醨嚟藜邌離鯏鏫鯬鵹黧囄灕蘺" +
                    "			蠡蠫孋廲劙鑗穲籬驪鱺鸝礼李里俚峛哩娌峲浬逦理裡锂粴裏豊鋰鲤澧禮鯉蟸醴鳢邐鱧欚力历厉屴立吏朸丽利励呖坜沥苈例岦戾枥疠苙隶俐俪栃栎疬砅茘荔赲轹郦娳悧栗栛涖猁珕砺砾秝莅唳婯悷琍笠粒粝蚸蛎傈凓厤棙痢蛠詈跞雳塛慄搮溧蒚蒞鉝鳨厯厲暦歴瑮綟蜧勵曆歷篥隷鴗巁檪濿癘磿鬁儮曞櫔爄犡禲蠇嚦壢瀝瓅礪藶櫪爏瓑攊皪攭盭礫糲蠣儷癧礰鷅麜囇轢欐讈轣瓥靂鱱靋瓈",
            "Lia俩倆",
            "Lian醶薟莶槏溓稴蘝蘞檶熑燫瀮譧嫾奁连帘怜涟莲連梿联裢亷嗹廉慩漣蓮匲奩覝劆匳噒憐磏聨聫褳鲢濂濓縺翴聮薕螊櫣聯臁蹥謰鎌镰簾蠊鬑鐮鰱籢籨敛琏脸裣摙槤璉蔹嬚斂歛臉鄻襝羷练炼恋殓堜媡湅萰链僆楝煉瑓潋練澰錬殮鍊鏈瀲鰊戀纞",
            "Liang悢駺莨倞靓靚良俍凉梁涼椋辌粮粱墚踉樑輬糧両两兩唡啢掚脼裲緉蜽魉魎亮哴谅辆喨晾湸量輌諒輛鍄",
            "Liao漻藔療繚尦缪繆飂橑潦蟧樛摎窌蹽辽疗聊僚寥嵺廖憀膋嘹嫽寮嶚嶛憭撩敹獠缭遼暸燎璙窷膫竂镣鹩屪廫簝蟟豂賿蹘爎鐐髎飉鷯钌釕鄝蓼爒镽了尥炓料尞撂瞭",
            "Lie劦忚燤哷爄巁綟棙栵爉獦咧挘埓列劣冽劽姴挒洌茢迾埒浖烈烮捩猎猟蛚裂煭聗趔巤颲儠鮤鴷擸獵犣躐鬛鬣鱲脟",
            "Lin綝冧厸菻拎痳碄箖霖臨麐壣瀶崊啉惏淋晽琳磷邻林临凛凜撛廩廪懍懔澟檁檩癛癝吝恡悋赁焛賃蔺橉甐膦閵疄藺蹸躏躙躪轥鏻鳞粼鄰隣麟鱗潾獜粦嶙遴斴暽燐璘辚瞵磷繗翷轔驎亃僯阾",
            "Ling羐稜棱伶刢灵囹坽夌姈岭岺彾泠狑苓昤朎柃玲瓴凌皊砱秢竛铃陵鸰婈崚掕棂淩琌笭紷绫羚翎聆舲菱蛉衑祾詅跉軨蓤裬鈴閝零龄綾蔆輘霊駖澪蕶錂霗魿鲮鴒鹷燯霛霝齢酃鯪孁蘦齡櫺醽靈欞爧麢龗袊领領嶺令另呤炩",
            "Liu斿漻碌陆摎窌溜熘刘畄浏流留旈琉畱硫裗媹嵧旒蒥蓅遛馏骝榴瑠飗劉瑬瘤磂镏駠鹠橊璢疁镠癅蟉駵嚠懰瀏藰鎏鎦餾麍鏐飀鐂騮飅鰡鶹驑柳栁桞珋桺绺锍綹熮罶鋶橮羀嬼六翏塯廇澑磟鹨蹓霤雡飂鬸鷚瓼甅",
            "Lo咯",
            "Long滝瀧弄竜尨龍龒篢龙屸咙泷茏昽栊珑胧眬砻笼聋隆湰嶐槞漋癃窿篭嚨巃巄蘢鏧霳曨朧櫳爖瓏矓礱礲襱籠聾蠪蠬龓豅躘鑨靇鸗陇垄垅拢儱隴壟壠攏竉哢梇硦徿贚驡",
            "Lou貗鷜露寠娄偻婁喽溇蒌僂楼嘍廔慺蔞遱樓熡耧蝼瞜耬艛螻謱軁髅鞻髏嵝搂塿嶁摟漊甊篓簍陋屚漏瘘镂瘺瘻鏤",
            "Lu謢輅率卛氀驴闾榈閭馿膢櫚藘曥鷜驢吕呂侣郘侶旅梠焒祣稆铝屡絽缕屢膂膐褛鋁履褸儢穞縷穭垏律哷虑率绿嵂氯葎綠緑慮箻勴繂櫖爈鑢緑瞜慺僂偻六蓼露噜撸嚕擼卢庐芦垆枦泸炉栌胪轳舮鸬玈舻颅鈩鲈魲" +
                    "			盧嚧壚廬攎瀘獹璷蘆櫨爐瓐臚矑籚纑罏艫蠦轤鑪顱髗鱸鸕黸卤虏挔捛掳鹵硵鲁虜塷滷蓾樐澛魯擄橹磠镥瀂櫓氌艣鏀艪鐪鑥圥甪陆侓坴彔录峍勎赂辂陸娽淕淥渌硉菉逯鹿椂琭祿禄僇剹勠滤盝睩碌稑賂路塶廘摝漉箓粶蔍戮樚熝膔膟趢踛辘醁潞穋蕗錄録錴璐簏螰鴼濾簶蹗轆騄鹭簬簵鏕鯥鵦鵱麓鏴騼籙觻虂鷺氇",
            "Luan乿薍臡覶娈孪峦挛栾鸾脔滦銮鵉圝奱孌孿巒攣曫欒灓羉臠圞灤虊鑾癴癵鸞卵乱釠亂",
            "Lue稤寽掠略畧锊圙鋝鋢",
            "Lun芲抡掄仑伦囵沦纶侖轮倫陯圇婨崘崙惀淪菕棆腀碖綸蜦踚輪磮錀鯩稐耣论埨溣論",
            "Luo擽躒捰洜渃寽攎硦囖攊皪攭跞烙磱蛒詻咯硌捋頱囉罗啰猡脶萝逻椤腡锣箩骡镙螺羅覶鏍儸覼騾玀蘿邏欏鸁籮鑼饠驘剆倮砢蓏裸躶瘰蠃臝攞曪癳泺峈洛络荦骆珞笿絡落摞漯犖雒駱鮥鵅纙濼",
            "Ma孖抹摩菻痳絔硥妈媽麻痲嫲蔴犘蟆蟇马犸玛码蚂馬溤獁遤瑪碼螞鎷鷌鰢亇杩祃閁骂唛傌睰嘜榪禡罵駡鬕吗嗎嘛",
            "Mai薶埋霾买荬買嘪蕒鷶劢迈佅売麦卖脉脈麥衇勱賣邁霡霢",
            "Man嫚娨蔓槾鄤澫埋颟顢悗蛮慲摱馒樠瞒瞞鞔饅鳗鬗鬘鰻蠻屘満满滿螨襔蟎鏋矕曼僈谩墁幔慢漫獌缦蔄蔓熳澷镘縵蟃謾鏝蘰",
            "Mang盳朚庬氓牤邙吂忙汒芒杗杧盲厖恾笀茫哤娏浝牻硭釯铓痝蛖鋩駹蘉莽莾茻壾漭蟒蠎匁尨狵",
            "Mao堥夘柕髳萺鉾罞氂犛秏毟猫貓毛矛枆牦茅旄渵軞酕锚緢髦蝥錨蟊鶜冇卯戼峁泖茆昴铆笷蓩鉚冃皃芼冐茂冒眊贸耄袤覒媢帽貿鄚愗暓楙毷瑁瞀貌鄮蝐懋唜",
            "Me麼麽嚜庅嚒濹嚰么",
            "Mei韎櫗糜穈殙羙坆沒没枚玫苺栂眉脄莓梅珻脢郿堳媒嵋湄湈猸睂葿楣楳煤瑂禖腜塺槑酶镅鹛鋂霉徾鎇攗鶥黴毎每凂美挴浼媄嵄渼媺镁嬍燘躾鎂黣妹抺沬昧祙袂眛媚寐痗跊鬽煝睸魅篃蝞嚜",
            "Men玧汶亹斖怋瞒瞞鞔悗惛椚门扪钔門閅捫菛璊穈鍆虋闷焖悶暪燜懑懣们們",
            "Meng莔雺霿髳黽黾鋂尨蟒掹擝氓甿虻冡庬萌夢溕盟甍儚橗瞢蕄蝱鄳鄸幪懞濛獴曚朦檬氋矇礞鯍艨鹲矒靀饛顭鸏勐猛蒙锰艋蜢錳懵蠓鯭鼆孟梦夣懜霥",
            "Mi禰瓕瞴沕糸摵枈檷袮彌镾濔瀰怽麿蘪咪瞇弥祢迷猕谜蒾詸謎醚沵擟糜縻麊麋靡獼麛爢戂攠蘼醾醿鸍釄米羋侎弭洣敉粎脒眯渳葞蔝銤孊灖糸汨宓泌觅峚宻祕秘密淧覓覔幂谧塓幎覛嘧榓滵漞熐蔤蜜鼏冪樒幦濗藌謐櫁簚羃",
            "Mian絻莬靦澠杣渑黽睌牑芇眠婂绵媔棉綿緜臱蝒嬵檰櫋矈矊矏丏汅免沔黾勉眄娩偭冕勔喕愐湎缅葂腼緬鮸靣面糆麪麫麺麵宀",
            "Miao玅劰缪繆緢厸仯喵苗媌描瞄鹋嫹鶓杪眇秒淼渺缈篎緲藐邈妙庙竗庿廟",
            "Mie烕乜旀眜簚芈礣吀咩哶孭灭搣滅蔑薎鴓幭懱瀎篾櫗蠛衊鑖鱴瓱覕",
            "Min賯渂忟呡砇忞鴖黾湏惽民垊姄岷怋旻旼玟苠珉盿罠崏捪琘琝缗暋瑉痻碈鈱緍緡錉鍲皿冺刡闵抿泯勄敃闽悯敏笢笽湣閔愍敯黽閩僶慜憫潣簢鳘蠠鰵",
            "Ming名明鸣洺眀茗冥朙眳铭鄍嫇溟猽蓂暝榠銘鳴瞑螟覭佲姳凕慏酩命掵詺",
            "Miu谬缪繆謬",
            "Mo万帓歾靺獏瀎攠戂嚜沒没癦庅冒脉嬤嬷狢貈貉嘿骳摸嚤尛谟嫫馍摹模膜麼麽摩魹橅磨糢謨謩擵饃蘑髍魔劘饝抹懡末圽妺歿殁沫茉陌帞昩枺皌眜眿砞秣莈莫眽絈袹蛨貃嗼塻寞漠蓦貊銆墨嫼暯瘼瞐瞙镆魩黙縸默貘藦蟔鏌爅驀礳纆耱乮",
            "Mou桙堥厶鞪缪繆踎蛑呣哞牟侔劺恈眸谋謀鍪鴾麰某",
            "Mu娒朷樢牟縸莫模缪繆姥畂母毪氁亩牡姆拇峔牳畆畒胟畝畞砪畮鉧踇木仫目凩沐狇坶炑牧苜毣莯蚞钼募雮墓幕幙慔楘睦鉬慕暮艒霂穆鞪丆椧",
            "Na笚蒘抐挐鈉搻南秅拏拿誽镎鎿乸哪雫内那吶妠纳肭娜衲钠納袦捺笝豽軜貀嗱蒳靹魶郍",
            "Nai搱腉孻耏佴乃奶艿氖疓妳廼迺倷釢嬭奈柰耐萘渿鼐褦螚錼摨",
            "Nan柟妠嫨囝囡男抩枏侽南娚畘莮喃遖暔楠煵諵难難赧揇湳萳腩蝻戁婻",
            "Nang蠰搑瀼憹涳囔乪嚢囊鬞馕欜饢擃曩攮灢儾齉",
            "Nao獶撓譊桡橈蟯臑憹摎孬檂呶怓挠峱硇铙猱蛲詉碙嶩夒鐃巎獿垴恼悩脑匘脳堖惱嫐瑙腦碯闹婥淖閙鬧",
            "Ne抐吶哪讷呐眲訥呢疒",
            "Nei錗脮浽娞內那内哪氞馁腇餒鮾鯘氝",
            "Nen媆嫰恁嫩",
            "Neng螚能",
            "Ni疑輗孴掜儗聣抐蛪呢妳誽濔聻懝莻銰妮尼坭怩泥籾倪屔秜郳铌埿婗淣猊蚭棿跜鈮蜺觬貎霓鲵鯢麑齯臡伱伲你拟抳狔苨柅旎晲馜儞隬擬薿檷氼昵胒逆匿眤堄惄嫟愵溺睨腻暱縌膩嬺屰",
            "Nian蹍輾榐辗粘溓淰涊蹨艌蔫惗焾唸拈年秊哖秥鲇鮎鲶鵇黏鯰捻辇撚撵碾輦簐攆躎卄廿念姩埝",
            "Niang孃娘嬢酿醸釀",
            "Niao鳥溺樢鸟茑袅嫋裊蔦嬝褭嬲尿脲",
            "Nie鋷銸囐噛槷嚙钀掜摄攝菍捻痆鑈乜峊湼捏揑帇圼苶枿陧涅聂臬啮隉敜嗫嵲踂摰踗踙镊镍嶭篞臲錜颞蹑鎳闑孼孽櫱籋蘖齧巕糱糵蠥囓讘躡鑷顳脌聶囁",
            "Nin恁囜您拰",
            "Ning苧倿宁咛拧狞柠聍寍寕寜寧儜凝嚀嬣擰獰薴檸聹鑏鬡鸋橣矃佞侫泞甯寗澝濘",
            "Niu汼莥怓抝拗妞牛牜忸扭沑狃纽杻炄钮紐鈕靵",
            "Nong燶农侬哝浓脓秾農儂辳噥濃蕽禯膿穠襛醲欁繷弄挊挵癑齈譨",
            "Nou檽獳檽蹃搙羺槈耨鎒鐞",
            "Nu帑奴孥驽笯駑伮努弩砮胬怒傉搙聏沑女钕籹釹衂恧朒衄",
            "Nuan煖湪奻渜暖煗餪",
            "Nue疟虐瘧硸",
            "Nun黁",
            "Nuo詝鍩挼耎愞袳挪搙难難娜毭袲梛傩搻儺橠诺喏掿逽搦锘榒稬諾糑懦懧糥穤糯",
            "O喔嚄噢哦筽夞乯",
            "Ou禺髃謳嘔区區毆吽讴欧殴瓯鸥塸歐熰甌膒鴎櫙藲鏂鷗吘呕偶腢耦蕅藕怄沤慪漚",
            "Pa掱钯妑皅趴舥啪葩杷爬琶筢潖帊帕怕袙扒耙苩汃",
            "Pai迫廹渒簲沠猈拍俳徘排猅牌棑箄輫簰哌派湃蒎鎃",
            "Pan丬洀盻盤胖肨眫萠番膰闆湴叛牉盼畔袢詊溿頖鋬鵥襻鑻眅畨潘攀爿盘柈跘搫媻幋蒰槃磐縏蹒瀊蟠蹣鎜鞶冸判沜泮炍磻般坢拌籓",
            "Pang眫庬尨趽徬乓汸沗肨胮雱滂膖霶厐庞逄旁舽嫎篣螃鳑龎龐鰟嗙耪覫炐胖彷膀磅",
            "Pao跁瓟烰袌抛拋脬咆垉庖狍刨炮炰爮袍匏軳鞄褜麅跑奅泡疱皰砲萢麭礟礮麃藨穮靤嚗",
            "Pei媐婄抷淠棑坏妃柭琣锫裴裵賠錇俖伂沛佩帔姵斾旆浿珮配蓜辔馷嶏霈轡呸怌肧柸胚衃醅阫陪培毰赔妚攈犻",
            "Pen喷噴濆歕瓫盆湓葐呠翸喯",
            "Peng苹輧淜痭絣篣袶亨蘕騯摓髼蟚蟛鬅纄韼鵬鬔鑝捧淎皏剻掽椪碰踫浌巼闏乶喸匉伻怦抨泙恲胓砰梈烹硑軯閛漰嘭駍磞芃朋挷竼倗莑堋弸彭棚椖傰塜塳硼稝蓬鹏槰樥熢憉澎輣篷搒漨膨錋韸",
            "Pi嚊疋妚嶏罷坏副否蕃蚾濞禆吡被陂罢豼焷琵脾腗榌鲏罴膍蜱隦魮壀鮍篺螷貔羆鵧朇鼙釽蠯匹庀仳圮苉脴痞銢諀鴄擗噽癖嚭屁淠揊媲嫓潎僻澼甓疈譬鷿鸊螕鎞枈辟稫箆鞞丕伓伾批纰邳坯怶披抷炋狉狓砒悂秛秠紕铍旇翍耚豾鈚鈹鉟銔劈磇駓髬噼錃錍魾憵礔礕闢霹皮阰芘岯枇肶毗毘疲笓蚍郫陴啤埤崥蚽",
            "Pian璸瑸便扁獱琕片囨偏媥犏篇翩鶣骈胼腁楄楩賆骿蹁駢騈覑谝貵諞骗魸騗騙猵緶跰",
            "Piao朴莩鰾骠剽彯漂缥飘旚縹翲螵犥飃飄魒瓢薸闝殍瞟篻醥皫顠票僄勡嘌嫖徱慓",
            "Pie潎覕氕撇撆暼瞥丿苤鐅嫳",
            "Pin汖聘娦蠙蘋姘拼礗穦馪驞玭贫貧嫔频頻嬪薲嚬矉颦顰品榀朩牝频拚砏",
            "Ping檘硑胓泙馮冯庰屏帡枰洴玶荓瓶屛帲淜萍蚲塀簈幈焩甁缾聠蓱蛢評軿鲆凴慿箳憑鮃娉乒甹俜涄砯艵竮頩平评凭呯坪岼苹郱",
            "Po奤朴翍陂搫嚩濼泺繁醗泊湐髲陂钋坡岥泼釙颇溌酦潑醱鏺婆嘙蔢鄱皤櫇叵尀钷笸鉕駊廹岶迫敀昢洦珀哱烞破砶粕蒪頗魄覇",
            "Pou婄犃娝咅哣棓剖抔掊裒抙捊箁垺",
            "Pu箁攵獛捗瀑堡暴兺哛仆攴扑抪炇巬柨陠痡铺噗撲鋪擈鯆圤匍莆菩菐葡蒱蒲僕酺墣璞濮瞨穙镤贌纀鏷朴圃埔浦烳普圑溥暜谱潽樸氆諩檏镨譜蹼鐠舖舗曝",
            "Qi傶枝祇忔踦锜錡綺滊螇栖恓棲氣呚嵜俟梩洓趞綮藒鐑揭伎啐墄袳隑攲敧稘毄緝觭鄿焏萕袷唊脥價七迉沏妻柒倛凄栖桤郪娸悽戚捿桼淒萋朞期欺紪褄僛嘁慽榿漆緀慼槭",
            "Qi扱忯亟缉稽丌竐畁亝蚔齊磩霋蹊魌鏚鶈亓祁齐圻岐岓芪其奇斉歧祈肵疧竒剘斊旂耆脐蚑蚚颀埼崎帺掑淇猉畦萁跂軝釮骐骑棊棋琦琪祺蛴愭碁碕褀頎鬿旗粸綥綦綨蜝蜞璂禥蕲螧鲯懠濝藄檱櫀簱臍騎騏鳍蘄鯕鵸鶀麒籏艩蠐鬐鰭玂麡乞邔企屺芑启呇杞玘盀唘豈起啓啔啟婍绮晵棨綮諬簯闙气讫気汔迄弃汽矵芞呮泣炁盵咠契砌荠栔訖唭欫夡岂愒棄湆湇葺碛摖薺暣甈碶噐憇器憩磜磧礘罊蟿",
            "Qia磍揢匼愘袷擖抲卡咭峠掐葜拤跒酠鞐圶冾帢恰洽殎硈髂胢",
            "Qian撍鉛膁玪孅纤欦臤慳荨羬槏伣俔嗛孯掔炶煔圲凵圱掅蚙厱挳欿葥唊朁磏犍鳽亁千仟阡奷扦汘芊迁佥岍杄汧茾竏钎拪牵粁悭蚈谸铅婜牽釺谦鈆謙綪僉愆签骞鹐搴摼撁諐遷褰顅檶攐攑櫏簽鏲鵮攓騫鐱鬜鬝籤韆仱岒忴扲拑乹前钤歬虔钱钳乾偂掮揵軡媊鈐鉗墘榩箝銭潜橬錢黔鎆黚騝濳騚灊籖鰬浅肷淺嵰慊遣蜸潛谴缱繾譴鑓欠刋芡茜倩悓堑塹傔嵌棈椠皘蒨歉蔳儙槧篏輤篟壍嬱縴兛瓩",
            "Qiang羗啌廧薔摪彊矼鸧鶬疆呛羌戕戗斨枪玱猐跄嗴椌獇腔嗆溬蜣锖嶈戧槍牄瑲羫锵篬蹌镪蹡鎗鏘鏹強强抢搶墙嫱蔷樯漒蔃墻嬙檣牆謒艢蘠羟羥墏摤繈襁繦炝唴熗羻",
            "Qiao喿撽丂箾骹睄燆勪橾鞘幓鐰韒鞩毃墧雀殻峤嶠潐噭燋礉摮磝壳悄偢硗郻嵪跷鄡鄥劁敲踍锹墝碻頝墽幧橇缲繰菬磽鍫鍬繑趬蹺蹻乔侨荍荞桥硚喬僑槗谯嘺嫶憔蕎鞒樵橋犞癄瞧礄藮譙趫鐈鞽顦巧釥愀髜俏诮陗峭帩窍殼翘誚髚僺撬鞘竅翹躈",
            "Qie猰稧嗛帹郄慊契砌栔趄椄疌跙伽伽切苆癿茄聺且厒妾怯匧窃悏挈洯惬淁笡愜蛪朅箧锲篋踥穕鍥鯜竊籡",
            "Qin欽綅鈫覃嫀鵭忴扲嵰慬埐嶜肣寖廑矜亲侵钦衾骎菳媇嵚誛嶔親顉駸鮼寴庈芩芹珡矝秦耹菦蚙捦琴琹禽鈙雂勤嗪溱靲噙擒斳鳹懄檎澿瘽螓懃蠄坅昑笉梫赾寑锓寝寢鋟螼吢吣抋沁唚菣揿搇撳瀙藽",
            "Qing啨殸寈親亲錆綪綮渹靑青氢轻倾卿郬圊氫淸清傾廎蜻輕鲭鑋夝甠剠勍情硘晴棾氰葝暒殑擏箐樈擎檠黥苘顷请庼頃漀請檾謦庆凊掅碃箐靘慶磬儬濪罄櫦埥軽鯖",
            "Qiong琁嬛瓊瓗宆跫銎卭邛穷穹茕桏笻筇赹惸焪焭琼舼蛩蛬煢熍睘瞏窮儝憌橩璚藑竆藭",
            "Qiu汓恷橚蓲渞厹湫湬龜塸頄艽芁龟牫丘丠仇邱坵恘秋秌蚯媝萩楸鹙篍緧蝵穐趥鳅蟗鞦鞧蘒鰌鰍鶖龝叴囚扏犰玌朹肍求虬泅虯俅觓訄訅酋唒浗紌莍逎逑釚梂殏毬球赇釻崷巯湭皳盚遒煪絿蛷裘巰觩賕璆蝤銶醔鮂鼽鯄蠤鰽搝糗",
            "Qu翑蝺魼胊蚼欪煀焌鶌瞿趍欔苣爠区區曲佉匤岖诎阹驱坥屈岴抾浀祛胠袪蛆躯筁粬蛐詘趋趨趣嶇駆憈敺誳伹駈麹髷麯軀麴黢驅鰸鱋佢劬斪朐菃衐鸲淭渠絇葋軥蕖璖磲螶鴝璩翵蟝鼩蘧忂灈戵欋氍籧臞癯蠷衢躣蠼鑺鸜取竘娶紶詓竬龋齲厺去刞呿迲耝阒觑閴麮闃覰覷鼁覻",
            "Quan狋奍灥槫箞捲弮矔犭犮恮跧甽峑悛圈圏棬駩騡鐉全权佺诠姾泉洤荃拳牷辁啳埢婘惓痊硂铨湶犈筌絟葲搼楾瑔觠詮輇蜷銓権踡縓醛闎鳈鬈孉巏鰁權齤蠸颧顴犬畎烇绻綣虇劝券牶椦勧韏勸",
            "Que汋碏卻碻琷缼蚗傕敠敪炔缺蒛瘸却埆崅悫雀硞确阕塙搉皵阙鹊愨榷墧慤確趞燩闋礐闕鵲礭棤",
            "Qun箘歏麇夋囷峮逡宭帬裙羣群裠踆",
            "Ra亽罖",
            "Ran橪熯呥肰衻袇蚦袡蚺然髥嘫髯燃繎冄冉姌苒染珃媣蒅",
            "Rang儴勷蘘纕穣瀼獽禳瓤穰躟鬤壌嚷壤攘爙让懹譲讓",
            "Rao蕘嬈穘荛饶桡橈襓饒扰娆隢擾绕遶繞",
            "Re捼渃喏惹热熱",
            "Ren祍棯葚釼釰菍釼亻人仁壬忈朲忎秂芢鈓魜銋鵀忍荏栠栣荵秹稔綛躵刃刄认仞仭讱任屻扨纫妊牣纴肕轫韧饪姙紉衽紝訒軔杒梕袵絍腍靭靱韌飪認餁",
            "Reng扔仍辸礽芿陾",
            "Ri衵氜釼釰日驲囸鈤馹",
            "Rong傛槦嵤坈戎肜栄狨绒茙茸荣容峵毧烿媶嵘絨羢嫆搈搑榵溶蓉榕榮熔瑢穁蝾褣镕氄縙融螎駥嬫嶸爃鎔瀜曧蠑冗宂傇軵穃",
            "Rou脜譳厹禸柔粈媃揉渘葇瑈腬糅蝚蹂輮鍒鞣瓇騥鰇鶔楺煣韖肉宍",
            "Ru繻蝡檽獳檽挐吺女嶿邚如侞帤茹桇袽铷渪筎蒘銣蕠儒鴑嚅嬬孺濡薷鴽曘襦蠕颥醹顬鱬汝肗乳辱鄏入扖杁洳嗕媷溽缛蓐鳰褥縟擩",
            "Ruan堧撋壖檽阮朊软偄軟耎瑌腝媆碝緛輭瓀礝",
            "Rui笍銳鋭蜹汭惢苼鏸抐兊兌桵甤緌蕤蕊蕋橤繠蘂蘃芮枘蚋锐瑞睿叡壡兑",
            "Run膶瞤闰润閏閠潤橍",
            "Ruo捼叒若偌弱鄀婼渃焫楉嵶蒻箬篛爇鰙鰯鶸",
            "Sa泧躠鏾纚灑钑鞈攃蕯仨撒洒訯靸潵卅飒脎萨摋隡馺颯薩櫒栍虄",
            "Sai鰓思毢愢揌塞毸腮嘥噻鳃顋嗮赛僿賽簺",
            "San鏾仐潵帴參叄叅三弎叁毵毶厁毿犙鬖壭伞傘散糁馓橵糝糣糤繖鏒饊俕閐",
            "Sang桒桑槡嗓搡磉褬颡鎟顙丧喪",
            "Sao騷梢懆缲繰掻慅搔溞骚缫臊鳋颾騒鰠鱢扫掃嫂埽瘙氉矂髞繅",
            "Se闟雭鎍鱪摵閪塞廧薔拺粣槭色栜涩啬渋铯歮琗嗇瑟歰銫澁懎擌濇濏瘷穑澀璱瀒穡繬穯轖鏼譅飋洓",
            "Sen椮森槮襂",
            "Seng僧鬙縇",
            "Sha廈殺榝啑厦髿杉歰摋桬菨濈剎杀沙纱乷砂唦猀粆紗莎铩痧硰蔱裟樧魦鲨閷鎩鯊鯋繺傻儍倽唼啥帹萐喢歃煞翜翣閯霎箑刹",
            "Shai諰色摋攦筛篩簁簛晒曬",
            "Shan鱣鳣嶦柵掞剡挻姍釤縿歚潬蟺鱓撣儃禪栅閄單摻穇单禅掺山彡邖圸删刪杉芟姗衫钐埏狦珊舢痁脠軕笘閊跚剼搧嘇幓煽潸澘檆膻鯅羴羶闪陕炶煔陝閃晱睒熌覢讪汕疝苫扇訕赸傓善椫銏骟僐鄯墠墡缮嬗擅敾樿膳磰謆赡繕蟮譱贍鐥饍騸鳝灗鱔",
            "Shang禓湯贘汤愓漡埫伤殇商觞傷墒慯滳蔏殤熵螪觴謪鬺裳垧扄晌赏賞鑜丄上尙尚恦绱緔鋿鏛",
            "Shao召佋萷莦睄苕杓鞘弰捎梢烧焼稍旓筲艄輎蕱燒髾鮹勺芍柖玿韶少劭卲邵绍哨娋袑紹綤潲",
            "She泏摂折奓磼畭畬虵歙拾闍挕揲奢猞赊畲輋賒賖檨舌佘蛥舍捨厍设社舎厙蛇射涉涻渉設赦弽慑滠慴蔎蠂韘騇懾灄麝欇摄攝",
            "Shei谁誰",
            "Shen黮敒蜄吲信莘姺搷莘什曑幓鏒糝糣糂糁棯葚嫀淰參叄叅冞参申屾扟伸身侁呻妽籶绅罙诜柛氠珅穼籸娠峷甡眒砷堔深紳兟葠裑訷罧蓡詵甧蔘燊薓駪鲹鯓鵢鯵鰺神榊鉮鰰邥弞抌沈审矤哂矧谂谉婶渖訠審諗頣魫曋瞫嬸瀋覾讅肾侺昚甚胂涁眘渗祳脤腎愼慎椹瘆蜃滲鋠瘮",
            "Sheng縄繩狌琞殸乗娍渑繉甸乘椉升生阩呏声斘昇枡泩苼殅牲珄竔胜陞曻陹笙湦焺甥鉎聲鍟鼪鵿绳憴澠譝省眚偗渻圣晟晠剰盛剩勝貹嵊聖墭榺蕂橳賸",
            "Shi馶殖崻畤秲銴厔峙螫檡澤泽啫埶釶鉇箷戺謚釋嘘噓餙狶濕宩昰楴惿徥痑狧姼忕徥栅似硕碩忯咶宲匙耆尸失师呞虱诗邿鸤屍施浉狮師絁湤湿葹溮溼獅蒒蓍詩鉐實識亊鉃適瑡酾鳲蝨鳾褷鲺鍦鯴鰤鶳襹籭釃十饣什石辻佦时竍识实実旹飠峕拾炻祏蚀埘時莳寔湜遈塒嵵溡蒔榯蝕鉽食鲥鮖鼫鼭鰣史矢乨豕使始驶兘屎笶榁鉂駛士氏礻世丗仕市示卋式事侍势呩柹视试饰冟室恀恃拭是枾柿眂贳适栻烒眎眡舐轼逝铈視釈崼弑揓谥貰释勢嗜弒煶睗筮觢試軾鈰飾舓誓奭噬嬕澨諟諡遾餝螫簭籂襫鰘兙瓧",
            "Shou嘼涭扌敊収收手守垨首艏寿受狩兽售授绶痩膄壽瘦綬夀獣獸鏉",
            "Shu藷霔朱屬隃俞兪忬悆蒣怸緰咰鉥稌瑹儵属疋捒琡书殳抒纾叔杸枢陎姝倏倐書殊紓掓梳淑薥尌焂菽軗鄃疎疏舒摅毹毺綀输跾踈樞蔬輸橾鮛攄瀭鵨尗秫婌孰赎塾熟璹贖暏暑黍署鼠鼡蜀潻薯曙癙襡糬襩籔蠴鱰朮术戍束沭述侸怷树竖荗恕庶庻絉蒁術裋数竪腧墅漱潄數澍豎樹濖錰鏣鶐虪",
            "Shua刷唰耍誜",
            "Shuai缞縗率卛衰摔甩帅帥蟀卛",
            "Shuan槫絟闩拴閂栓涮腨",
            "Shuang瀧漺泷双霜雙孀骦孇騻欆礵鷞鹴艭驦鸘爽塽慡樉縔鏯灀",
            "Shui娷挩捝說説稅说谁脽誰氵水氺閖帨涗涚祱税裞睡",
            "Shun眴吮楯顺舜順蕣橓瞚瞤瞬鬊",
            "Shuo爍鑠說説箾獡洬愬数數銏说妁烁朔铄欶硕碩矟搠蒴槊鎙",
            "Si傂銉鯣飴耛杫蜤燍磃鋖枱鈶食簛愢偲洠糸纟厶丝司糹私咝泀俬思恖鸶媤斯絲缌蛳楒禗鉰飔凘厮榹禠罳銯锶嘶噝廝撕澌緦蕬螄鍶蟖蟴颸騦鐁鷥鼶死虒巳亖四寺汜伺似佀兕姒泤祀価孠泗饲驷俟娰柶牭梩洍涘肂飤笥耜釲竢覗嗣肆貄鈻飼禩駟蕼儩瀃乺",
            "Song愡揔吅摗棇楤漎忪松枀枩娀柗倯凇梥崧庺淞菘嵩硹憽檧濍鬆怂悚捒耸竦傱愯嵷慫聳駷讼宋诵送颂訟頌誦餸鎹",
            "Sou棷撨叜捒欶嗽籔鏉颾摉凁捜鄋嗖廀廋搜溲獀蒐蓃馊飕摗锼艘螋醙鎪餿颼騪叟傁嗾瞍擞薮擻藪櫢瘶",
            "Su稡莤梀碿潚橚宿埣摵圱棴苏甦酥稣窣穌鯂蘇蘓櫯囌俗玊夙诉泝肃洬涑珟素速殐粛骕傃粟訴谡嗉塐塑嫊愫溯溸肅遡鹔僳洬愬榡膆蔌觫趚遬憟樎樕潥鋉餗縤璛簌藗謖蹜驌鱐鷫",
            "Suan篹狻痠酸匴祘笇筭蒜算篹",
            "Sui嗺睟夊芕毸娞韢鏸缞縗尿虽倠哸浽荽荾眭滖睢熣濉鞖雖绥隋随遀綏隨瓍膸瀡髄髓亗岁砕祟谇埣嵗遂歲歳煫碎隧嬘澻穂誶賥檖燧璲禭穗穟繀襚邃旞繐繸鐆譢鐩",
            "Sun簨剸塼漙篿扻筍簨孫鶽摌喰孙狲荪飧搎猻蓀飱槂蕵薞损笋隼損榫箰鎨",
            "Suo璅些嗍莎挱嫅縒褨唆娑莏傞挲桫梭睃嗦羧蓑摍缩趖簑簔縮鮻所唢索琐琑惢锁嗩暛溑瑣鎍鎖鎻鏁逤溹蜶獕",
            "Ta鉈闟拓傝粏漯嗒沓溚鎉鞈她他它牠祂咜趿铊塌榙溻褟蹹侤塔墖獭鮙鳎獺鰨挞狧闼崉涾搨遝遢阘榻毾禢撻澾誻踏嚃錔嚺濌蹋鞜闒鞳闥譶躢襨",
            "Tai珆旲枱忕徥奤斄汱汏大囼孡骀胎台邰坮抬苔炱炲跆鲐箈臺颱儓鮐嬯擡薹檯籉太冭夳忲汰态肽钛泰舦酞鈦溙態燤駘菭",
            "Tan錟燂鐔橝荨蕁嘾彈繵儃澹弹镡襢坍贪怹啴痑舑貪摊滩嘽潬瘫擹攤灘癱坛昙倓谈郯婒惔弾覃榃痰锬谭墰墵憛潭談醈壇曇檀顃罈藫壜譚貚醰譠罎忐坦袒钽菼毯鉭嗿憳憻暺醓璮叹炭埮探傝湠僋嘆碳舕歎",
            "Tang湯餳愓伖灙汤铴嘡劏羰蝪薚镗蹚鏜鐋鞺鼞饧坣唐堂傏啺棠鄌塘嵣搪溏蓎隚榶漟煻瑭禟膅樘磄糃膛橖篖糖螗踼糛螳赯醣鎕餹闛饄鶶帑倘偒淌傥耥躺镋鎲儻戃曭爣矘钂烫摥趟燙",
            "Tao抭夵匋饀跳涭轁叨夲弢涛绦掏絛詜嫍幍慆搯滔槄瑫韬飸縚縧濤謟鞱韜饕迯咷洮逃桃陶啕梼淘绹萄祹裪綯蜪鞀醄鞉鋾駣檮騊鼗讨套討畓",
            "Te貸忑忒特铽慝鋱蟘",
            "Teng熥膯鼟疼痋幐腾誊漛滕邆縢螣駦謄儯藤騰籐鰧籘虅驣霯朰",
            "Ti禵褆擿荑桋趯屟屜歒笹睼鷤磃褆徥啑奃苐媂俶眣棣弟媞薙嚔剔梯锑踢銻鷈鷉厗绨偍珶啼崹惿提渧稊缇罤遆鹈嗁瑅綈碮徲漽緹蕛题趧蹄醍謕蹏鍗鳀題鮷鵜騠鯷鶗鶙体挮躰骵軆體戻屉剃倜悌涕逖悐惕掦逷惖揥替裼褅殢髰嚏鬀瓋鬄籊",
            "Tian紾铦銛盷呑瑱舚奵栝銽甸钿佃天兲婖添酟靔黇靝田屇沺恬畋畑胋甛甜菾湉填搷阗碵緂磌窴鴫璳闐鷆鷏忝殄倎唺悿淟晪琠腆觍痶睓舔餂覥賟錪掭塡",
            "Tiao啁銚恌蓨斢苕萔蓧朷铫旫佻庣挑祧聎芀条岧岹迢祒條笤蓚龆樤蜩鋚鞗髫鲦鯈鎥齠鰷宨晀朓脁窕誂窱嬥眺粜絩覜趒跳糶调調",
            "Tie銕贴萜貼铁蛈僣鐵驖呫帖飻餮怗聑跕鉄",
            "Ting桯庍忊侱町铤甼厅庁汀听耓厛烃烴綎鞓聴聼廰聽廳邒廷亭庭莛停婷嵉渟筳葶蜓楟榳閮霆聤蝏諪鼮圢侹娗挺涏梃烶珽脡艇颋誔鋌頲濎乭",
            "Tong獞偅硧筩赨燑詷峝侗垌峒囲炵通痌嗵蓪樋仝同佟彤峂庝哃狪茼晍桐浵烔砼蚒眮秱铜童粡絧衕酮鉖僮勭銅餇鲖潼曈朣橦氃犝膧瞳鮦统捅桶筒統綂恸痛慟憅鉵穜",
            "Tou飳愉婾媮緰亠鋀埱偷偸鍮头投骰頭妵紏敨斢黈蘣透",
            "Tu檡墿悇瑹宊鋀趃啚摕凸禿秃怢突唋涋捸堗湥痜葖嶀鋵鵚鼵図图凃峹庩徒捈涂荼途屠梌揬稌塗嵞瘏筡腯蒤鈯圖圗廜跿酴馟鍎駼鵌鶟鷋鷵土圡吐汢钍釷兎迌兔莵堍菟鵵潳",
            "Tuan剸塼漙篿畽墥揣湍猯煓貒团団抟團慱槫檲鏄糰鷒鷻圕疃彖湪褖摶剸塼漙篿",
            "Tui讉蛻聉侻忒墤橔弚弟推蓷藬颓隤頹頺頽魋穨蘈蹪俀腿僓蹆骽退娧煺蜕褪駾尵",
            "Tun涒褪噋憞庉囤蛌吞呑朜焞暾黗屯芚饨豘豚軘鲀魨霕臀臋氽坉旽啍忳飩",
            "Tuo阤杝狏詑彵扡挩捝撱鰖啴鋖铊嶞沲鮵乇讬托汑饦侂咃拕拖沰侻莌袥託涶脫脱飥魠驮佗陀坨岮沱驼柁砣砤袉鸵紽堶跎酡碢馱槖駄駝駞橐鮀鴕鼧騨鼍驒鼉妥毤庹媠椭楕嫷橢鵎拓柝唾跅毻箨籜仛杔馲驝陁萚蘀",
            "U癷袰蝊曢烪燞蒊稥毜毝桛毮朑虲鐢艈霻闧焑屗徚鍂聁",
            "Wa穵啘鮭婠瓾呙凹聉唲窐咼韎帓屲劸哇娃徍挖洼娲畖窊媧嗗蛙搲溛漥窪鼃攨瓦佤邷咓瓲砙袜嗢腽膃襪韈韤",
            "Wai顡瀤咼呙歪喎竵崴外",
            "Wan杬蚖夗惌箢鋺乛涴妧輐脕絻掔夘槾澫綄萖蟃蔓瞣晥莞弯剜婠帵塆湾睕蜿潫豌彎壪灣丸刓汍纨芄完岏忨抏玩笂紈捖顽烷琓貦頑宛倇唍挽晚盌埦婉惋晩梚绾脘菀晼椀琬皖畹碗綩綰輓踠鋔万卍卐杤捥腕萬翫鋄薍錽鎫贃贎",
            "Wang迬尣徍抂朚罒罓尩尪尫汪亡亾兦王仼彺莣蚟网往徃枉罔惘菵暀棢蛧辋網蝄誷輞瀇魍妄忘忹迋旺盳望朢",
            "Wei嶉欈隹遗猚叞燰琟維厃痏薳韡圩唩倭撱捼瓗磈撝囲矀瞆危威烓偎逶隇隈喴媁媙愄揋揻渨葨葳微椳楲溦煨詴縅蝛覣嶶薇鳂癐巍鰃鰄醀囗为韦围帏沩违闱峗峞洈為韋桅涠唯帷惟维喡圍嵬幃湋溈爲違潍蓶鄬潙潿濰鍏闈鮠癓覹犩霺伟伪尾纬芛苇委炜玮洧娓捤浘荱诿偉偽崣梶硊萎隗骩嵔廆徫愇猥葦蒍骪骫暐椲煒瑋痿腲艉韪僞碨蜲蜼鲔寪緯蔿諉踓韑頠儰濻鍡鮪壝韙颹瀢亹斖卫未位味苿畏胃軎尉菋谓喂媦渭猬煟墛蔚慰熭犚硙磑緭蝟衛懀璏罻衞謂餧鮇螱褽餵魏藯轊鏏霨鳚蘶饖讆躗讏躛",
            "Wen繧缊韫緼縕榅辒輼轀歾忞呅駇鞰玟昷塭温殟溫瑥榲瘟豱鳁鎾饂鰛鰮文彣纹芠炆砇闻紋蚉蚊珳阌雯瘒聞馼魰鳼鴍螡閺閿蟁闅鼤闦刎吻抆忟呡肳紊桽脗稳穏穩问妏汶莬問渂揾搵絻顐璺",
            "Weng攚勜翁嗡鹟螉鎓鶲奣塕嵡滃蓊暡瞈聬瓮蕹甕罋齆",
            "Wo撾馧枂臒涴媼捾薶咼濄龏呙緺挝倭涡渦莴唩涹猧萵喔窝窩蜗蝸踒我婐婑捰仴沃肟卧臥偓媉幄握渥焥硪楃腛斡瞃濣瓁龌齷媪",
            "Wu杅於峿鋙扜扝汙汚烏歍吳郚娪亡渞蟱墲瞴娒譕沕雺堥扝鋘膴陚惡卼僫柮乌圬弙污邬呜杇巫屋洿诬钨趶剭窏釫鄔嗚誈誣箼螐鴮鎢鰞无毋吴吾呉芜梧洖浯茣莁珸祦鹀無蜈蕪璑鵐鯃鼯鷡乄五午仵伍坞妩庑忤怃迕旿武玝侮俉倵捂啎娬牾珷塢摀熓碔鹉瑦舞嫵廡憮潕儛橆甒鵡躌兀勿务戊阢伆屼扤岉杌芴忢物矹敄误務悞悟悮粅逜晤焐婺嵍痦隖靰骛奦嵨溩雾寤熃誤鹜鋈窹霚鼿霧齀蘁騖鶩",
            "Xi羛诶鐊焬熈誒歖潝屓屭悕邜鳃郄磎扢塈咭咥欸扱糦欪摡嶲巂繫縘愾釐禰瓕鉨鉩恓舃碏钑鈒雭獡夕兮忚汐西吸希卥昔析矽穸肸肹俙徆怸郗饻唏奚娭屖息悕晞氥浠牺狶莃唽悉",
            "Xi裼洒茜咭栖腊忾囍饎惜喺桸欷淅渓烯焁焈琋硒菥赥釸傒惁晰晳焟犀睎稀扸杫粞翕翖舾鄎厀嵠徯溪煕皙蒠锡僖榽熄熙緆蜥豨餏嘻噏嬆嬉瘜膝凞樨橀歙熹熺熻窸羲螅螇錫燨犠瞦礂蟋谿豀豯貕繥雟鯑鵗觹譆醯鏭隵巇曦爔犧酅觽鼷蠵鸂觿鑴习郋席習袭觋媳椺蒵蓆嶍漝覡趘槢薂隰檄謵鎴霫鳛飁騱騽襲鰼驨枲洗玺徙喜葈葸鈢屣漇蓰铣銑憘憙暿橲禧諰壐縰謑蟢蹝璽鱚矖纚躧匸卌戏屃系饩呬忥怬细係恄盻郤欯绤細釳阋塈椞舄趇隙慀滊禊綌赩隟熂犔稧潟澙蕮覤戱戲黖磶虩餼鬩嚱闟霼衋",
            "Xia疨磍捾徦夾埉芐螛鎼厦瘕夹鯱唬呷虾谺傄閕敮煆颬瞎蝦鰕匣侠狎俠峡柙炠狭陜峽烚狹珨祫硖笚翈舺陿硤遐暇瑕筪碬舝辖蕸縖赮魻轄鍜霞鎋黠騢鶷閜丅下吓圷疜夏梺廈睱諕嚇懗罅夓鏬",
            "Xian醶綖麙嬐薟唌湺衘崄險嶮硍羨麲玹軐洗铣銑盷姺綅欦臤羬槏嗛溓稴懢壏搚埳見閒瞯咁彡摻塪橌见銽掺仙仚屳先奾纤佡忺氙杴祆秈苮籼珗莶掀跹酰锨枮僊僲嘕铦銛鲜暹韯憸鍁繊褼韱鮮馦蹮孅廯攕譣纎鶱襳躚纖" +
                    "			鱻咞闲伭妶弦贤咸挦涎胘娴娹婱絃舷蚿衔啣痫蛝閑鹇嫌甉銜嫺嫻憪撏澖誸賢諴輱醎癇癎藖鹹礥贒鑦鷳鷴鷼冼狝显险毨烍猃蚬険赻筅尟尠搟禒蜆跣箲獫獮藓鍌燹顕幰攇櫶蘚玁韅顯灦县岘苋现线臽限姭宪県陥哯垷娊峴晛涀莧陷現馅睍絤缐羡献粯腺僩僴綫誢撊線鋧憲橌縣錎餡豏瀗臔獻糮鏾霰鼸",
            "Xiang羏羊詳潒儴勷蘘纕衖銗閧闂降夅乡芗相香郷厢鄉鄊廂湘缃葙鄕楿薌箱緗膷襄忀骧麘欀瓖镶鱜鑲驤瓨佭鮝详庠栙祥絴翔跭享亯响蚃饷晑飨想銄餉鲞嚮蠁鯗響饗饟鱶向姠巷项珦象缿萫項像勨嶑曏橡襐蟓鐌鱌",
            "Xiao獟殽烋薂箾莦颵骹睄嗃熇蛸俏姣灱灲呺枭侾削哓枵骁宯宵庨消绡虓逍鸮婋梟焇猇萧痚痟硝硣窙翛销揱綃嘐歊潇箫踃嘵憢撨獢銷霄彇膮蕭魈鴞穘簘藃蟂蟏鴵嚣瀟簫蟰髇嚻囂櫹髐鷍蠨驍毊虈洨郩崤淆訤誵小晓暁筱筿皛曉篠謏皢孝肖効咲恔俲哮效校涍笑啸傚敩詨嘋嘨誟嘯歗熽斅斆",
            "Xie靾枻栧叶偞峫洩紲絏緤血梋縀碿齛榝搚繲觧孈儶觟鮭烲韘樧契挟解颉嚡鲑獦些楔歇蝎蠍劦协旪邪協胁垥奊恊拹挾脅脇脋衺偕斜谐猲絜翓嗋愶携鞢瑎綊熁膎勰撷擕緳缬蝢鞋諧燲擷鞵襭攜纈讗龤写冩寫藛伳灺泄泻祄绁缷卸炧炨卨娎屑偰徢械焎禼亵媟屟揳渫絬谢僁塮榍榭褉噧屧暬韰嶰廨懈澥獬糏薢薤邂燮褻謝夑瀉瀣爕蟹蠏齘齥齂躠躞",
            "Xin訢襑礥愖忄莘镡心邤妡忻芯辛昕杺欣盺俽惞鈊锌新歆廞噷噺嬜薪馨鑫馫枔伈阠伩囟孞炘信軐脪衅訫焮馸舋顖釁鋅",
            "Xing滎荥葕巠饧省行兴狌星垶骍惺猩煋瑆腥蛵觪箵篂興謃曐觲騂皨刑邢形陉侀郉哘型洐钘陘娙硎铏鈃鉶銒鋞睲醒擤杏姓幸性荇倖莕婞悻涬緈嬹臖鮏鯹",
            "Xiong焸賯焽熋凶兄兇匈芎讻忷汹哅恟洶胷胸訩詾雄熊诇詗夐敻匂",
            "Xiu脩褎褏銹嗅潃宿鱃嚊休俢修咻庥烌羞脙鸺臹貅馐樇銝髤髹鎀鮴鵂饈鏅飍苬朽滫糔秀岫珛绣袖琇锈溴綉璓螑繍繡鏥鏽齅峀臭",
            "Xu芧惐淢矞喐蛡獝藇鱮吁怴綇休邪妶圩緰蓲諿恓晇眗掝滸蚼滀嘼禑裇聓燸朐湏砉浒畜戌旴疞盱欨胥须訏顼虗虚谞媭揟欻虛須楈頊嘘稰需魆噓墟嬃歔縃蕦蝑歘諝譃魖驉鑐鬚俆徐蒣许呴姁诩冔栩珝偦許湑暊詡鄦糈醑盨旭伵序汿侐卹沀叙恤昫洫垿欰殈烅珬勖勗敍敘烼绪续酗喣壻婿朂溆絮訹慉煦続蓄賉槒漵潊盢瞁緒聟銊稸緖藚續蓿",
            "Xuan弲楥喛駨夐敻縣县伭妶鋗懁券吅轩昍咺宣晅軒梋谖喧塇媗愃愋揎萱萲暄煊瑄蓒睻儇禤箮翧蝖嬛蕿諠諼鍹駽矎翾藼蘐蠉譞鰚讂玄玹痃悬旋琁蜁嫙漩暶璇檈璿懸选烜暅選癣癬怰泫昡炫绚眩袨铉琄眴衒渲絢楦鉉碹蔙镟鞙颴縼繏鏇贙",
            "Xue辥瞲敩削泬噱彐滈壆辪疶蒆靴薛鞾穴斈乴坹学岤峃茓泶袕鸴踅學嶨澩燢觷鷽雪樰膤艝轌鳕鱈血吷怴狘疦桖谑趐謔瀥",
            "Xun稄蟫爓廵潯煇眴孫鶽咰荨姰濬郇孙畃巺潠浚坃勋埙焄勛塤熏窨蔒勲勳薫駨嚑壎獯薰曛燻臐矄蘍壦爋纁醺寻巡旬驯杊询峋恂洵浔紃荀栒桪毥珣偱尋循揗詢馴鄩鲟噚攳樳燅燖璕蟳鱏鱘灥卂训讯伨汛迅侚徇狥迿逊殉訊訓訙奞巽殾遜愻噀蕈顨鑂",
            "Ya轧軋釾椻齾揠氬猰聐圔稏窫邪覀碣冴姶瓛拁圧疋潝疨磍丫压呀庘押鸦桠鸭孲铔椏鴉錏鴨壓鵶鐚牙伢岈芽厓枒琊笌蚜堐崕崖涯猚睚衙漄齖厊庌哑唖啞痖雅瘂蕥劜圠亚襾讶亜犽迓亞玡垭娅挜砑俹氩埡婭掗訝",
            "Yan黰囐齗殷嬐烻剡橪鳱閼晻洝羬窴铅梴咽恹剦烟珚胭崦淹焉菸阉湮腌傿煙鄢嫣漹嶖樮醃閹嬮篶懕臙黫讠延闫严妍芫言訁岩昖沿炎郔姸娫狿研莚娮盐琂硏訮閆阎嵒嵓筵綖蜒塩揅楌詽碞蔅颜虤閻厳檐顏顔嚴壛巌簷櫩綖壧孍巖巗巚欕礹鹽麣夵抁沇乵兖奄俨兗匽弇",
            "Yan歅嚈殗曣唌喦炏淊溎埏啱懨嵼衍偃厣掩眼萒郾酓嵃愝扊揜棪渰渷琰遃隒椼硽罨裺演褗戭蝘魇噞躽縯檿黡厴甗鰋鶠黤齞龑儼黬黭顩鼴巘曮魘鼹齴黶厌妟觃牪姲彥彦砚唁宴晏艳覎验偐掞焔谚隁喭堰敥焰焱猒硯雁椻滟鳫厭墕暥熖酽嬊谳餍鴈燄燕諺赝鬳曕鴳酀騐験嚥嬿艶贋軅爓醶騴鷃灔贗觾讌醼饜驗鷰艷灎釅驠灧讞豓豔灩",
            "Yang锳勜飬婸瑒详愓蝆玚央咉姎抰泱殃胦眏秧鸯鉠雵鞅鍈鴦扬羊阦阳旸杨炀佯劷氜疡钖飏垟徉昜洋羏烊珜眻陽崵崸揚蛘敭暘楊煬禓瘍諹輰鍚鴹颺鰑霷鸉卬仰佒坱岟养炴氧痒紻傟軮慃氱養駚懩攁瀁癢礢怏楧柍恙样羕詇様漾樣",
            "Yao鎐钥箹约約隃邎怮恌匋撽侥烄僥滧铫窕陶疟鱙么皋皐铫幺夭吆妖枖祅訞喓葽楆腰邀爻尧尭肴垚姚峣轺倄烑珧窑傜堯鎐蓔揺殽谣軺嗂媱徭愮搖摇猺遙遥摿暚榣瑤瑶銚飖餆嶢嶤徺磘窯窰餚繇謠謡鳐颻蘨顤鰩仸宎岆抭杳殀狕苭咬柼眑窅窈舀偠婹崾溔榚鴢闄騕齩鷕穾药要袎窔筄葯詏熎覞靿獟鹞薬鼼曜燿艞藥矅耀纅鷂讑鑰",
            "Ye拽煠捙曵咽窫瑘緤峫鐷焆瓛痷邪射擖璍喝揲倻椰暍噎潱蠮爷耶捓揶铘爺釾鋣鎁擨也吔亪冶埜野嘢漜壄业叶曳页邺夜抴亱枼頁晔枽烨掖液谒堨殗腋葉墷楪業馌僷曄曅歋燁擛皣瞱鄴靥嶪嶫澲謁餣擫曗瞸鍱擪爗礏鎑饁鵺靨驜鸈",
            "Yi叕秇妷栺杝乚鄓焬狏迱彵扡鴺珆箷釶裿儗欥昳拸叆泄熙尾洟食篒蛇射渏懝睪一弌辷衤伊衣医吚壱依祎咿洢猗畩郼铱壹揖欹蛜禕嫛漪稦銥嬄噫夁瑿鹥繄檹毉醫黟譩鷖黳乁仪匜圯夷冝宐沂诒侇宜怡沶狋衪迤饴咦姨峓弬恞柂瓵荑贻迻宧巸扅栘桋眙胰袘酏痍移萓媐椬羠蛦詒貽遗暆椸誃跠頉颐飴疑儀熪遺嶬彛彜螔頤頥寲嶷簃顊鮧彝彞謻鏔籎觺讉鸃乙已以迆钇佁攺矣苡苢庡舣蚁釔倚扆笖逘偯崺旑椅鈘鉯鳦旖輢敼螘檥礒艤蟻顗轙齮乂义亿弋刈忆",
            "Yi攲敧疙蛾艺仡匇肊议阣亦伇屹异忔芅佚劮呓坄役抑杙耴苅译邑佾呭呹峄怈怿易枍泆炈绎诣驿俋奕帟帠弈枻浂玴疫羿轶唈垼悒挹栧欭浥浳益袣谊貤陭勚埶埸悘悥殹異羛翊翌萟訲訳豙豛逸釴隿幆敡晹棭殔湙焲蛡詍跇鈠骮亄兿意溢獈痬竩缢義肄裔裛詣勩嫕廙榏潩瘗膉蓺蜴駅億撎槸毅熠熤熼瘞誼镒鹝鹢黓劓圛墿嬑嬟嶧憶懌曀殪澺燚瘱瞖穓縊艗薏螠褹寱斁曎檍歝燡燱翳翼臆貖鮨癔藙藝贀鎰镱繶繹豷霬鯣鶂鶃鶍瀷蘙譯議醳醷饐囈鐿鷁鷊懿襼驛鷧虉鷾讛齸",
            "Yin欭岃湮硍梀輑赺堷窨圻廴囙因阥阴侌垔姻洇茵荫音骃栶殷氤陰凐秵裀铟陻隂喑乑斦軼堙婣愔筃絪歅溵禋蒑蔭慇瘖銦磤緸鞇諲霒駰噾濦闉霠韾冘吟犾苂垠泿圁峾烎狺珢粌荶訔唫婬寅崟崯淫訡银鈝龂滛碒鄞夤蔩訚誾銀龈噖殥璌嚚檭蟫霪齦鷣尹引吲饮蚓隐淾鈏飲隠靷飮朄趛檃瘾隱嶾濥螾蘟櫽癮讔印茚洕胤垽湚猌廕酳慭癊憖憗鮣懚檼",
            "Ying耺禜楧柍眏桯旲鱦嵤焸夃鶑焽爃景浧应応英偀桜珱莺啨婴媖愥渶绬朠煐瑛嫈碤嘤撄滎甇緓缨罂蝧賏樱璎噟罃褮霙鴬鹦嬰應膺韺甖鎣鹰鶧嚶孆孾攖瀴罌蘡櫻瓔礯譻鶯鑍纓蠳鷪軈鷹鸎鸚盁迎茔盈荥荧莹萤营萦蛍営溁溋萾僌塋楹滢蓥潆熒蝇瑩蝿嬴營縈螢濙濚濴藀覮謍赢巆攍瀛瀠瀯蠅櫿灐籝灜贏籯矨郢梬颍颕颖摬影潁瘿穎頴巊廮鐛癭映暎硬媵膡鞕瀅譍",
            "Yo哟唷喲",
            "Yong蒏牗揘銿佣拥痈邕庸傭嗈鄘雍墉嫞慵滽槦牅噰壅擁澭郺镛臃癕雝鏞鳙廱灉饔鱅鷛癰喁颙顒鰫永甬咏怺泳俑勇勈栐埇悀柡涌恿惥愑湧硧詠塎嵱彮愹蛹慂踊鲬踴鯒用苚砽醟",
            "You甴栯冘羪痏汼獶揂妋獿优忧攸呦怮泑幽悠麀滺憂優鄾鈾嚘懮瀀櫌纋耰尢尤由沋犹邮怞油肬怣斿柚疣峳浟秞莜莤莸逌郵铀偤蚰訧逰游猶遊鱿楢猷鲉輏駀蕕蝣魷輶鮋櫾友有丣卣苃酉羑庮莠梄聈铕湵禉蜏銪槱牖牗黝又右幼佑侑孧狖哊囿姷宥峟牰祐诱迶唀梎蚴亴貁釉酭誘鼬",
            "Yu粥灹熨爩鴧鴪儥礇禦魊鹬癒礜穥篽醧鵒櫲饇蘛譽轝鐭霱欎驈鬻籞鱊鷸鸒欝軉鬰鬱灪籲捓藇娪叞痏琟婾媮翑齵肀桙丂僪欥頨吁雤邪吾蔚尉捥扝潏込粖汩谷硲扜纡迂迃穻陓紆虶唹淤盓渝圫瘀箊于亐予邘伃余妤扵杅欤玗玙於盂臾衧鱼俞兪禺竽舁奥奧茰娛娯娱狳谀酑馀渔萸釪隃隅雩" +
                    "			魚堣堬崳嵎嵛愉揄楰湡畬硢腴逾骬愚楡榆歈牏瑜艅虞觎漁睮窬舆褕歶羭蕍蝓諛雓餘魣嬩懙澞覦踰歟璵螸輿鍝礖謣鮽旟籅騟鯲鰅鷠鸆与伛宇屿羽雨俁俣挧禹语圄祤偊匬圉庾敔鄅萭萮铻傴寙斞楀瑀瘐與語窳龉噳嶼貐斔麌蘌齬玉驭聿芋芌妪忬饫育郁彧昱狱秗茟俼峪栯浴砡钰预域堉悆惐欲淢淯袬谕逳阈喅喩喻媀寓庽御棛棜棫焴琙矞裕遇飫馭鹆愈滪煜稢罭蒮蓣誉鈺預嫗嶎戫毓獄瘉緎蜟蜮輍銉隩慾稶蓹薁豫遹鋊鳿澦燏燠蕷諭錥閾鴥",
            "Yuan芫円楥薳涴妧喛裷宛茒圜囦鸢剈冤弲悁眢鸳寃渁渆渊渕淵葾棩蒬蜎鹓鳶蜵駌惌箢鋺鴛嬽鵷灁鼘鼝元贠邧园沅垣爰员貟員原圆笎袁厡酛圎援湲猨缘鈨鼋園圓塬媴嫄源溒猿蒝垸榞榬辕緣縁蝝蝯魭橼羱薗螈謜轅黿鎱櫞邍騵鶢鶰厵远盶逺遠杬蚖夗肙妴苑怨院衏傆媛掾瑗禐愿裫褑褤噮願",
            "Yue藥臒啘趯說説哾擽櫟髺樂妜矆噦扚泧说兊兌栎楽乐哕兑曰曱约約箹矱月戉刖岄抈礿岳枂玥恱钥悅悦蚎蚏軏钺阅捳跀跃粤越鈅粵鉞閱閲嬳樾篗嶽龠籆瀹蘥黦爚禴躍籥鸑籰龥鸙",
            "Yun蒀煴蒕熅奫蝹赟馧贇员貟員榅涒煇緷煾媼媪菀鞰筠云勻匀伝囩妘抣沄纭芸昀畇眃秐郧涢紜耘耺鄖雲愪氲溳筼蒷媪氳熉澐蕓鋆橒篔縜允阭夽抎狁玧陨荺殒喗鈗隕殞褞馻磒霣齫齳孕运枟郓恽晕鄆酝傊惲愠缊韫緼縕運慍暈腪韵熨蕰蕴薀賱醖醞餫藴韗韞蘊韻",
            "Za橴扎咋囋咱偺喒帀匝沞咂沯拶桚紥紮鉔魳臜臢杂砸韴雑襍雜囐雥噈囃",
            "Zai仔抂災灾畠甾菑哉栽烖渽溨睵賳宰载崽載再在扗洅傤酨儎縡",
            "Zan揝拶桚鐟橵堑塹鵤鏩兂糌簪簮鐕咱偺喒昝寁撍儧儹趱趲暂暫賛赞錾鄼攒攢濽蹔酂瓉贊鏨瓒酇灒讃瓚禶襸讚饡囋篸攅穳",
            "Zang牂羘赃賍藏臧匨賘贓髒贜驵駔奘弉脏塟葬銺臓臟蔵",
            "Zao傮遭糟蹧醩凿鑿早枣栆蚤棗璅澡璪薻藻灶皁皂唕唣造梍喿慥煰艁噪簉燥竃譟趮躁竈",
            "Ze灂睪滜側侧啫则沢択择泎泽迮則啧帻舴责責擇溭矠嘖嫧幘箦蔶樍歵唶笮諎赜澤皟瞔簀耫礋襗謮賾蠌齚齰鸅仄庂汄昃昗捑崱稄",
            "Zei贼賊鲗蠈鰂鱡",
            "Zen撍怎谮譖",
            "Zeng綜综囎縡鬵竲曽橧増鄫增憎缯熷璔矰磳罾繒譄鱛锃鋥甑赠贈",
            "Zha柤拃耫諎紥紮潳蜡喥喋查査吒咋抯挓柤哳偧喳揸渣溠楂劄皶箚樝觰皻譇齄齇扎札轧軋闸蚻铡煠牐閘霅鍘譗厏苲眨砟鲊鲝鮓鮺乍灹诈咤奓栅炸宱痄蚱詐搾摣榨醡剳",
            "Zhai擿抧厇厏责責擇択择祭哜嚌夈粂捚斋斎摘榸齋宅翟窄鉙债砦債寨瘵檡側侧",
            "Zhan僝怗枬嵁鳽碊颤欃沾毡旃栴粘蛅飦惉詀趈詹閚谵噡嶦薝邅霑氈氊瞻鹯旜譫饘鳣驙魙鸇讝斩飐展盏崭斬琖搌盞嶃嶄榐辗颭嫸醆橏皽黵占佔战栈桟站偡绽菚棧湛戦綻嶘戰虥虦覱轏蘸驏",
            "Zhang张兏弡張章傽鄣嫜彰慞漳獐粻蔁遧暲樟璋餦蟑鏱騿鱆麞仉涨涱掌漲幥礃鞝丈仗扙帐杖胀账粀帳脹痮障墇嶂幛賬瘬瘴瞕长仧長",
            "Zhao濯啅着皽菬釽鳭朝嘲佋钊妱巶招昭炤釗啁鉊駋鍣爫找沼瑵召兆诏枛垗狣赵笊肁旐棹罀詔照罩箌肇肈趙曌燳鮡櫂瞾羄鼂",
            "Zhe着蟅搩踷這扸杔馲乇聑螫蜇嫬遮厇折歽矺砓籷虴哲埑粍袩啠悊晢晣辄喆棏蛰詟谪摺輒磔輙銸辙蟄嚞謫謺鮿轍讁襵讋者锗赭褶鍺这柘浙淛嗻蔗樜鹧蟅鷓",
            "Zhen帧幀榐枮瑱填椹溱竧槙贞针侦浈珍珎貞帪桢眞真砧祯針偵桭酙寊湞葴遉搸斟楨獉甄禎蒖蓁鉁榛殝瑧碪禛潧箴樼澵臻薽錱轃鍼籈鱵屒诊抮枕姫弫昣胗轸畛疹眕袗紾聄萙裖覙診軫嫃缜稹駗縝縥辴鬒黰圳阵纼侲挋陣鸩振朕栚紖眹赈塦揕絼誫賑鋴镇震鴆鎭鎮",
            "Zheng靕幁埥綪丁徎憕鏳凧争佂姃征怔爭峥挣炡狰烝眐钲埩崝崢掙猙睁聇脀铮媜揁筝徰睜蒸鉦箏徴徵踭篜錚鬇癥氶抍糽拯掟塣晸愸撜整正证诤郑政症証鄭諍鴊證",
            "Zhi徴徵妷栺斦伿杫拓剬氏识呮捗摨郦擳楖夂臷眰聜泜摕槯淔痓絺捗只凪劧旨阯址坁帋扺汦沚纸芷抧祉茋咫恉指枳洔砋轵淽疻紙訨趾軹黹秇酯鶨迣藢襧至芖志忮扻豸制厔垁帙帜歭治炙质郅俧峙庢庤挃柣栉洷祑陟娡銴徏挚晊桎狾秩致袟贽轾乿偫徝掷梽猘畤痔秲秷窒紩翐" +
                    "			袠觗貭铚鸷傂崻彘智滞痣蛭骘寘廌搱滍稙稚筫置跱輊锧雉墆槜滯潌疐瘈製覟誌銍幟憄摯潪熫稺膣觯質踬鋕旘瀄緻隲駤鴙儨劕懥擲擿櫛穉螲懫贄櫍瓆觶騭鯯礩豑騺驇躓鷙鑕豒之支卮汁芝吱巵汥枝知织肢栀祗秓秖胑胝衹衼倁疷祬脂隻梔戠椥臸搘禔綕榰蜘馶鳷鴲織蘵鼅执侄坧直姪値值聀釞埴執职植殖禃絷跖瓡墌摭馽嬂慹漐踯樴膱縶職蟙蹠軄躑止祇",
            "Zhong斔銿種蜙蚣夂中伀汷徸緟刣妐彸忠泈炂终柊盅衳钟舯衷終鈡幒蔠锺螤鴤螽鍾鼨蹱鐘籦肿种冢喠尰塚歱煄腫瘇種踵仲众妕狆祌茽衶重蚛偅眾堹媑筗衆諥",
            "Zhou掫啁繇胕翢州舟诌侜周椆洲炿诪烐珘辀郮婤徟淍矪週鸼喌粥赒輈銂賙輖霌駲嚋盩謅鵃薵騆譸妯轴軸碡肘帚疛菷晭睭箒鯞纣伷呪咒宙绉冑咮昼紂胄荮晝皱酎粙葤詋甃僽皺駎噣縐骤籀籕籒驟",
            "Zhu鸀斀櫡属澍术朮尌簗逫燝丶帾篴拀褚朱劯侏诛邾洙茱株珠诸猪硃袾铢絑蛛誅跦槠潴蝫銖橥諸豬駯鮢鴸瀦藸櫧蕏櫫鼄鯺蠩竹竺炢笁茿烛窋逐笜舳瘃蓫燭蠋躅鱁劚孎灟斸曯欘爥蠾钃主宔拄砫罜陼渚煑煮嘱濐麈瞩屬囑矚伫佇住助纻芧苎坾杼注苧贮迬驻壴柱柷殶炷祝疰眝祩竚莇秼紵紸羜著蛀嵀筑註貯跓軴铸筯鉒飳馵墸箸翥樦鋳駐築篫麆鑄",
            "Zhua爫挝抓檛膼簻髽爪撾",
            "Zhuai拽跩睉",
            "Zhuan赚簨剸塼漙篿篹腞傳传专叀専砖專鄟嫥瑼甎膞颛磚諯蟤顓鱄转孨転竱轉灷啭堟蒃瑑僎赚撰篆馔縳襈賺譔饌囀籑僝磗耑",
            "Zhuang戅奘僮戆妆庄妝庒荘娤桩莊湷粧装裝樁糚壮壯状狀壵梉焋幢撞漴",
            "Zhui畷奞揣隹追骓椎锥錐騅鵻沝坠笍娷缀惴甀缒硾膇墜綴赘縋諈醊錣礈贅鑆腏队隊",
            "Zhun圫旽忳屯宒迍肫窀谆諄衠准埻凖準綧訰稕淳",
            "Zhuo著墌棹蓔聉燋淖捔缴藋剢焯卓拙炪倬捉桌棁涿棳琸窧槕穛穱蠿汋圴彴犳灼叕妰茁斫浊丵浞烵诼酌啄啅娺梲着斮晫椓琢斱硺窡罬撯擆斲禚劅諁諑鋜濁篧擢斀斵濯櫡謶镯鐯鵫灂蠗鐲籗鷟籱",
            "Zi沝吱畠甾菑荢畠洓緕纃蓻璾粢嗭茈呲仔孖孜茊兹咨姕姿茲栥玆紎赀资崰淄秶缁谘薋赼嗞孳嵫椔湽滋葘辎鄑孶禌觜貲資趑锱稵緇鈭镃龇輜鼒澬諮趦輺錙髭鲻鍿鎡頾頿鯔鶅齍鰦齜籽子吇姉姊杍矷秄胏呰秭耔虸笫梓釨啙紫滓訾訿榟字自芓茡倳剚恣牸渍眥眦胔胾漬",
            "Zong鍐繌揌糭从枞焧從樅潨宗倧综骔堫嵏嵕惾棕猣腙葼朡熜椶嵸稯綜緃熧緵翪蝬踨踪磫豵蹤騌鬃騣鬉鬷鯮鯼鑁总偬捴惣揔搃傯蓗摠総縂燪總鍯纵昮疭倊猔碂粽糉瘲縦縱潀潈",
            "Zou媰邹驺诹郰陬掫菆棷棸鄒箃緅諏鄹鲰鯫黀騶齺赱走鯐奏揍搊齱楱",
            "Zu唨柤鎐怚租菹葅蒩卆足卒哫崒崪族稡箤踤镞鏃诅阻组俎爼珇祖組詛靻鎺倅", "Zuan鉆篹劗躜鑚躦鑽繤缵纂纉籫纘钻揝攥",
            "Zui稡觜冣咀厜朘嗺樶蟕纗嶊嘴噿濢璻栬絊酔晬最祽罪辠酻蕞醉嶵檇鋷錊檌欈睟",
            "Zun瀳袸栫尊嶟遵樽繜罇鶎鐏鳟鱒鷷僔噂撙譐捘銌墫拵",
            "Zuo穝琢苲唶笮諎凿柮嘬昨秨莋捽椊葃稓筰鈼左佐繓作坐阼岝岞怍侳柞祚胙唑座袏做葄蓙飵糳咗酢撮"};

    /**
     * 特殊字，优先拼写音节
     */
    private static Map<Character, String> specialCharMap = new HashMap<Character, String>();

    static {
        specialCharMap.put('广', "Guang");
        specialCharMap.put('南', "Nan");
        specialCharMap.put('石', "Shi");
        specialCharMap.put('厦', "Xia");
        specialCharMap.put('佛', "Fo");
        specialCharMap.put('合', "He");
        specialCharMap.put('沈', "Shen");
        specialCharMap.put('区', "Qu");
    }

    private ChineseSpellConverter() {
    }

    /**
     * 获得汉字字符串对应的拼音，自动转小写
     *
     * @param cnStr 需要转换的字符串
     * @return
     */
    public static String getChineseSpell(String cnStr) {
        return getChineseSpell(cnStr, LOWER_STYLE);
    }

    /**
     * 获得汉字字符串对应的拼音
     *
     * @param cnStr     需要转换的字符串
     * @param styleFlag 返回格式，使用ChineseSpellConverter的静态常量，cnStr为NULL或空字符串就原值返回
     * @return
     */
    public static String getChineseSpell(String cnStr, int styleFlag) {
        return converting(cnStr, styleFlag, false);
    }

    /**
     * 转化汉字为拼音首字母缩写，非汉字保持不变，自动转为全小写
     *
     * @param cnStr 需要转换的字符串
     * @return
     */
    public static String getSimpleSpell(String cnStr) {
        return getSimpleSpell(cnStr, LOWER_STYLE);
    }

    /**
     * 转化汉字为拼音首字母缩写，非汉字保持不变，大小写可配置
     *
     * @param cnStr     汉字字符串
     * @param styleFlag 返回格式，使用ChineseSpellConverter的静态常量，cnStr为NULL或空字符串就原值返回
     * @return
     */
    public static String getSimpleSpell(String cnStr, int styleFlag) {
        return converting(cnStr, styleFlag, true);
    }

    /**
     * 转换方法，根据大小写标识和是否简写模式，对汉字进行拼音转化
     *
     * @param cnStr     汉字字符串
     * @param styleFlag 大小写类型
     * @param isSimple  是否简写模式
     * @return
     */
    private static String converting(String cnStr, int styleFlag, boolean isSimple) {
        if (cnStr == null || cnStr.length() == 0) {
            return cnStr;
        }
        char[] chars = cnStr.toCharArray();
        int len = chars.length;
        StringBuffer myStr = new StringBuffer();
        for (int i = 0; i < len; i++) {
            // 若是字母则直接输出
            if ((int) chars[i] >= CHINESE_FLOOR && (int) chars[i] <= CHINESE_CEILING) {
                // 若字符Unicode编码在编码范围,则先查优先音节，后查汉字列表进行转换输出
                String tempSpell;
                if (specialCharMap.get(chars[i]) != null) {
                    tempSpell = specialCharMap.get(chars[i]);
                    if (isSimple) {
                        myStr.append(tempSpell.charAt(0));
                    } else {
                        myStr.append(tempSpell);
                    }
                    continue;
                }
                for (int j = 0; j < strChineseCharList.length; j++) {
                    if (strChineseCharList[j].indexOf(chars[i]) >= 0) {
                        tempSpell = strChineseSpellList[j];
                        if (isSimple) {
                            myStr.append(tempSpell.charAt(0));
                        } else {
                            myStr.append(tempSpell);
                        }
                        break;
                    }
                }
            } else {
                myStr.append(chars[i]);
            }
        }
        String resultStr = myStr.toString();
        if (styleFlag == UP_STYLE) {
            resultStr = resultStr.toUpperCase();
        } else if (styleFlag == LOWER_STYLE) {
            resultStr = resultStr.toLowerCase();
        }
        return resultStr;
    }


}
